//CREATEI  JOB (A),'D J YOUNG',MSGCLASS=Y,NOTIFY=DJY00                          
//VTAMDEF  EXEC  PGM=DFHCSDUP                                                   
//STEPLIB  DD  DSN=CICS410.SDFHLOAD,DISP=SHR                                    
//DFHCSD  DD  DSN=CICS.CICBPT01.DFHCSD,DISP=SHR                                 
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN  DD  *                                                                  
DELETE GROUP(DB2GRP)                                                            
DELETE GROUP(COBOL2)                                                            
DELETE GROUP(CRTS)                                                              
DELETE GROUP(CEE)                                                               
DELETE LIST(TLIST)                                                              
DEFINE TYPETERM(3180S)     GROUP(CRTS)          DEVICE(3270)                    
       DEFSCREEN(24,80)    ALTSCREEN(32,80)     BUILDCHAIN(NO)                  
       BRACKET(YES)        SENDSIZE(1920)       AUDIBLEALARM(YES)               
       DUALCASEKYBD(YES)   UCTRAN(YES)          COLOR(NO)                       
       EXTENDEDDS(NO)      HILIGHT(NO)          LIGHTPEN(NO)                    
       ERRLASTLINE(NO)     ERRINTENSIFY(NO)     ERRCOLOR(NO)                    
       ERRHILIGHT(NO)      AUTOCONNECT(YES)     ATI(YES)                        
       TTI(YES)            LOGONMSG(YES)        RELREQ(YES)                     
       SIGNOFF(YES)        RECEIVESIZE(1920)    IOAREALEN(2000,4000)            
       TERMMODEL(2)        DESCRIPTION(ATTRIBUTES FOR 3278 MODEL 2)             
       SHIPPABLE(YES)                                                           
*                                                                               
DEFINE TYPETERM(LU2)       GROUP(CRTS)          DEVICE(LUTYPE2)                 
       DEFSCREEN(24,80)    ALTSCREEN(32,80)     BUILDCHAIN(NO)                  
       BRACKET(YES)        SENDSIZE(1536)       AUDIBLEALARM(YES)               
       DUALCASEKYBD(YES)   UCTRAN(YES)          COLOR(NO)                       
       EXTENDEDDS(NO)      HILIGHT(NO)          LIGHTPEN(NO)                    
       ERRLASTLINE(NO)     ERRINTENSIFY(NO)     ERRCOLOR(NO)                    
       ERRHILIGHT(NO)      AUTOCONNECT(YES)     ATI(YES)                        
       TTI(YES)            LOGONMSG(YES)        RELREQ(YES)                     
       SIGNOFF(YES)        RECEIVESIZE(256)    IOAREALEN(256,4000)              
       TERMMODEL(2)        DESCRIPTION(ATTRIBUTES FOR 3278 MODEL 2)             
       SHIPPABLE(YES)                                                           
*                                                                               
DEFINE TERMINAL(C020)    NETNAME(HM31T020)      GROUP(CRTS)                     
       TYPETERM(3180S)   AUTINSTMODEL(NO) INSERVICE(NO)                         
*                                                                               
DEFINE TERMINAL(C021)    NETNAME(TCP00001)      GROUP(CRTS)                     
       TYPETERM(LU2)   AUTINSTMODEL(YES) INSERVICE(YES)                         
*                                                                               
DEFINE TERMINAL(C022)    NETNAME(TCP00002)      GROUP(CRTS)                     
       TYPETERM(LU2)   AUTINSTMODEL(YES) INSERVICE(YES)                         
*                                                                               
DEFINE TERMINAL(C023)    NETNAME(TCP00003)      GROUP(CRTS)                     
       TYPETERM(LU2)   AUTINSTMODEL(YES) INSERVICE(YES)                         
*                                                                               
DEFINE TERMINAL(C024)    NETNAME(TCP00004)      GROUP(CRTS)                     
       TYPETERM(LU2)   AUTINSTMODEL(YES) INSERVICE(YES)                         
*                                                                               
DEFINE TERMINAL(C025)    NETNAME(TCP00005)      GROUP(CRTS)                     
       TYPETERM(LU2)   AUTINSTMODEL(YES) INSERVICE(YES)                         
*                                                                               
DEFINE TERMINAL(C026)    NETNAME(TCP00006)      GROUP(CRTS)                     
       TYPETERM(LU2)   AUTINSTMODEL(YES) INSERVICE(YES)                         
*                                                                               
DEFINE TERMINAL(C027)    NETNAME(TCP00007)      GROUP(CRTS)                     
       TYPETERM(LU2)   AUTINSTMODEL(YES) INSERVICE(YES)                         
*                                                                               
DEFINE TERMINAL(C028)    NETNAME(TCP00008)      GROUP(CRTS)                     
       TYPETERM(LU2)   AUTINSTMODEL(YES) INSERVICE(YES)                         
*                                                                               
DEFINE TERMINAL(C029)    NETNAME(TCP00009)      GROUP(CRTS)                     
       TYPETERM(LU2)   AUTINSTMODEL(YES) INSERVICE(YES)                         
*                                                                               
DEFINE TERMINAL(C030)    NETNAME(TCP00010)      GROUP(CRTS)                     
       TYPETERM(LU2)   AUTINSTMODEL(YES) INSERVICE(YES)                         
*                                                                               
DEFINE TERMINAL(C031)    NETNAME(TCP00011)      GROUP(CRTS)                     
       TYPETERM(LU2)   AUTINSTMODEL(YES) INSERVICE(YES)                         
*                                                                               
DEFINE TERMINAL(C032)    NETNAME(TCP00012)      GROUP(CRTS)                     
       TYPETERM(LU2)   AUTINSTMODEL(YES) INSERVICE(YES)                         
*                                                                               
DEFINE TERMINAL(C033)    NETNAME(TCP00013)      GROUP(CRTS)                     
       TYPETERM(LU2)   AUTINSTMODEL(YES) INSERVICE(YES)                         
*                                                                               
DEFINE TERMINAL(C034)    NETNAME(TCP00014)      GROUP(CRTS)                     
       TYPETERM(LU2)   AUTINSTMODEL(YES) INSERVICE(YES)                         
*                                                                               
DEFINE TERMINAL(C035)    NETNAME(TCP00015)      GROUP(CRTS)                     
       TYPETERM(LU2)   AUTINSTMODEL(YES) INSERVICE(YES)                         
*                                                                               
DEFINE TERMINAL(C036)    NETNAME(TCP00016)      GROUP(CRTS)                     
       TYPETERM(LU2)   AUTINSTMODEL(YES) INSERVICE(YES)                         
*                                                                               
DEFINE TERMINAL(C037)    NETNAME(TCP00017)      GROUP(CRTS)                     
       TYPETERM(LU2)   AUTINSTMODEL(YES) INSERVICE(YES)                         
*                                                                               
DEFINE TERMINAL(C038)    NETNAME(TCP00018)      GROUP(CRTS)                     
       TYPETERM(LU2)   AUTINSTMODEL(YES) INSERVICE(YES)                         
*                                                                               
DEFINE TERMINAL(C039)    NETNAME(TCP00019)      GROUP(CRTS)                     
       TYPETERM(LU2)   AUTINSTMODEL(YES) INSERVICE(YES)                         
*                                                                               
DEFINE TERMINAL(C040)    NETNAME(TCP00020)      GROUP(CRTS)                     
       TYPETERM(LU2)   AUTINSTMODEL(YES) INSERVICE(YES)                         
*                                                                               
DEFINE TERMINAL(CSYS)    GROUP(CRTS)     TYPETERM(DFHCONS)                      
       CONSNAME(SYSLOG)                                                         
*                                                                               
DEFINE TERMINAL(CDJY)    GROUP(CRTS)     TYPETERM(DFHCONS)                      
       CONSNAME(DJY00)                                                          
*                                                                               
DEFINE TERMINAL(C001)    GROUP(CRTS)     TYPETERM(DFHCONS)                      
       CONSNAME(EC20220)                                                        
*                                                                               
DEFINE TERMINAL(C002)    GROUP(CRTS)     TYPETERM(DFHCONS)                      
       CONSNAME(EC20221)                                                        
*                                                                               
DEFINE TERMINAL(C022)    NETNAME(HM31T022)      GROUP(CRTS)                     
       TYPETERM(3180S)   AUTINSTMODEL(YES) INSERVICE(YES)                       
*                                                                               
*                                                                               
DEFINE TERMINAL(0001)    NETNAME(TPNS0001)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0002)    NETNAME(TPNS0002)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0003)    NETNAME(TPNS0003)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0004)    NETNAME(TPNS0004)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0005)    NETNAME(TPNS0005)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0006)    NETNAME(TPNS0006)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0007)    NETNAME(TPNS0007)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0008)    NETNAME(TPNS0008)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0009)    NETNAME(TPNS0009)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0010)    NETNAME(TPNS0010)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0011)    NETNAME(TPNS0011)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0012)    NETNAME(TPNS0012)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0013)    NETNAME(TPNS0013)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0014)    NETNAME(TPNS0014)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0015)    NETNAME(TPNS0015)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0016)    NETNAME(TPNS0016)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0017)    NETNAME(TPNS0017)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0018)    NETNAME(TPNS0018)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0019)    NETNAME(TPNS0019)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0020)    NETNAME(TPNS0020)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0021)    NETNAME(TPNS0021)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0022)    NETNAME(TPNS0022)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0023)    NETNAME(TPNS0023)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0024)    NETNAME(TPNS0024)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0025)    NETNAME(TPNS0025)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0026)    NETNAME(TPNS0026)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0027)    NETNAME(TPNS0027)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0028)    NETNAME(TPNS0028)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0029)    NETNAME(TPNS0029)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0030)    NETNAME(TPNS0030)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0031)    NETNAME(TPNS0031)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0032)    NETNAME(TPNS0032)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0033)    NETNAME(TPNS0033)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0034)    NETNAME(TPNS0034)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0035)    NETNAME(TPNS0035)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0036)    NETNAME(TPNS0036)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0037)    NETNAME(TPNS0037)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0038)    NETNAME(TPNS0038)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0039)    NETNAME(TPNS0039)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0040)    NETNAME(TPNS0040)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0041)    NETNAME(TPNS0041)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0042)    NETNAME(TPNS0042)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0043)    NETNAME(TPNS0043)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0044)    NETNAME(TPNS0044)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0045)    NETNAME(TPNS0045)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0046)    NETNAME(TPNS0046)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0047)    NETNAME(TPNS0047)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0048)    NETNAME(TPNS0048)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0049)    NETNAME(TPNS0049)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0050)    NETNAME(TPNS0050)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0051)    NETNAME(TPNS0051)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0052)    NETNAME(TPNS0052)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0053)    NETNAME(TPNS0053)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0054)    NETNAME(TPNS0054)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0055)    NETNAME(TPNS0055)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0056)    NETNAME(TPNS0056)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0057)    NETNAME(TPNS0057)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0058)    NETNAME(TPNS0058)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0059)    NETNAME(TPNS0059)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0060)    NETNAME(TPNS0060)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0061)    NETNAME(TPNS0061)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0062)    NETNAME(TPNS0062)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0063)    NETNAME(TPNS0063)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0064)    NETNAME(TPNS0064)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0065)    NETNAME(TPNS0065)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0066)    NETNAME(TPNS0066)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0067)    NETNAME(TPNS0067)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0068)    NETNAME(TPNS0068)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0069)    NETNAME(TPNS0069)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0070)    NETNAME(TPNS0070)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0071)    NETNAME(TPNS0071)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0072)    NETNAME(TPNS0072)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0073)    NETNAME(TPNS0073)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0074)    NETNAME(TPNS0074)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0075)    NETNAME(TPNS0075)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0076)    NETNAME(TPNS0076)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0077)    NETNAME(TPNS0077)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0078)    NETNAME(TPNS0078)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0079)    NETNAME(TPNS0079)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0080)    NETNAME(TPNS0080)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0081)    NETNAME(TPNS0081)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0082)    NETNAME(TPNS0082)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0083)    NETNAME(TPNS0083)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0084)    NETNAME(TPNS0084)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0085)    NETNAME(TPNS0085)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0086)    NETNAME(TPNS0086)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0087)    NETNAME(TPNS0087)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0088)    NETNAME(TPNS0088)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0089)    NETNAME(TPNS0089)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0090)    NETNAME(TPNS0090)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0091)    NETNAME(TPNS0091)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0092)    NETNAME(TPNS0092)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0093)    NETNAME(TPNS0093)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0094)    NETNAME(TPNS0094)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0095)    NETNAME(TPNS0095)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0096)    NETNAME(TPNS0096)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0097)    NETNAME(TPNS0097)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0098)    NETNAME(TPNS0098)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0099)    NETNAME(TPNS0099)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0100)    NETNAME(TPNS0100)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0101)    NETNAME(TPNS0101)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0102)    NETNAME(TPNS0102)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0103)    NETNAME(TPNS0103)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0104)    NETNAME(TPNS0104)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0105)    NETNAME(TPNS0105)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0106)    NETNAME(TPNS0106)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0107)    NETNAME(TPNS0107)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0108)    NETNAME(TPNS0108)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0109)    NETNAME(TPNS0109)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0110)    NETNAME(TPNS0110)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0111)    NETNAME(TPNS0111)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0112)    NETNAME(TPNS0112)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0113)    NETNAME(TPNS0113)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0114)    NETNAME(TPNS0114)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0115)    NETNAME(TPNS0115)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0116)    NETNAME(TPNS0116)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0117)    NETNAME(TPNS0117)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0118)    NETNAME(TPNS0118)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0119)    NETNAME(TPNS0119)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0120)    NETNAME(TPNS0120)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0121)    NETNAME(TPNS0121)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0122)    NETNAME(TPNS0122)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0123)    NETNAME(TPNS0123)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0124)    NETNAME(TPNS0124)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0125)    NETNAME(TPNS0125)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0126)    NETNAME(TPNS0126)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0127)    NETNAME(TPNS0127)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0128)    NETNAME(TPNS0128)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0129)    NETNAME(TPNS0129)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0130)    NETNAME(TPNS0130)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0131)    NETNAME(TPNS0131)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0132)    NETNAME(TPNS0132)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0133)    NETNAME(TPNS0133)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0134)    NETNAME(TPNS0134)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0135)    NETNAME(TPNS0135)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0136)    NETNAME(TPNS0136)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0137)    NETNAME(TPNS0137)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0138)    NETNAME(TPNS0138)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0139)    NETNAME(TPNS0139)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0140)    NETNAME(TPNS0140)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0141)    NETNAME(TPNS0141)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0142)    NETNAME(TPNS0142)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0143)    NETNAME(TPNS0143)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0144)    NETNAME(TPNS0144)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0145)    NETNAME(TPNS0145)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0146)    NETNAME(TPNS0146)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0147)    NETNAME(TPNS0147)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0148)    NETNAME(TPNS0148)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0149)    NETNAME(TPNS0149)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0150)    NETNAME(TPNS0150)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0151)    NETNAME(TPNS0151)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0152)    NETNAME(TPNS0152)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0153)    NETNAME(TPNS0153)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0154)    NETNAME(TPNS0154)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0155)    NETNAME(TPNS0155)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0156)    NETNAME(TPNS0156)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0157)    NETNAME(TPNS0157)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0158)    NETNAME(TPNS0158)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0159)    NETNAME(TPNS0159)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0160)    NETNAME(TPNS0160)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0161)    NETNAME(TPNS0161)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0162)    NETNAME(TPNS0162)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0163)    NETNAME(TPNS0163)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0164)    NETNAME(TPNS0164)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0165)    NETNAME(TPNS0165)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0166)    NETNAME(TPNS0166)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0167)    NETNAME(TPNS0167)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0168)    NETNAME(TPNS0168)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0169)    NETNAME(TPNS0169)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0170)    NETNAME(TPNS0170)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0171)    NETNAME(TPNS0171)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0172)    NETNAME(TPNS0172)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0173)    NETNAME(TPNS0173)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0174)    NETNAME(TPNS0174)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0175)    NETNAME(TPNS0175)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0176)    NETNAME(TPNS0176)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0177)    NETNAME(TPNS0177)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0178)    NETNAME(TPNS0178)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0179)    NETNAME(TPNS0179)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0180)    NETNAME(TPNS0180)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0181)    NETNAME(TPNS0181)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0182)    NETNAME(TPNS0182)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0183)    NETNAME(TPNS0183)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0184)    NETNAME(TPNS0184)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0185)    NETNAME(TPNS0185)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0186)    NETNAME(TPNS0186)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0187)    NETNAME(TPNS0187)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0188)    NETNAME(TPNS0188)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0189)    NETNAME(TPNS0189)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0190)    NETNAME(TPNS0190)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0191)    NETNAME(TPNS0191)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0192)    NETNAME(TPNS0192)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0193)    NETNAME(TPNS0193)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0194)    NETNAME(TPNS0194)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0195)    NETNAME(TPNS0195)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0196)    NETNAME(TPNS0196)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0197)    NETNAME(TPNS0197)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0198)    NETNAME(TPNS0198)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0199)    NETNAME(TPNS0199)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0200)    NETNAME(TPNS0200)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0201)    NETNAME(TPNS0201)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0202)    NETNAME(TPNS0202)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0203)    NETNAME(TPNS0203)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0204)    NETNAME(TPNS0204)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0205)    NETNAME(TPNS0205)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0206)    NETNAME(TPNS0206)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0207)    NETNAME(TPNS0207)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0208)    NETNAME(TPNS0208)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0209)    NETNAME(TPNS0209)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0210)    NETNAME(TPNS0210)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0211)    NETNAME(TPNS0211)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0212)    NETNAME(TPNS0212)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0213)    NETNAME(TPNS0213)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0214)    NETNAME(TPNS0214)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0215)    NETNAME(TPNS0215)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0216)    NETNAME(TPNS0216)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0217)    NETNAME(TPNS0217)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0218)    NETNAME(TPNS0218)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0219)    NETNAME(TPNS0219)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0220)    NETNAME(TPNS0220)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0221)    NETNAME(TPNS0221)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0222)    NETNAME(TPNS0222)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0223)    NETNAME(TPNS0223)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0224)    NETNAME(TPNS0224)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0225)    NETNAME(TPNS0225)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0226)    NETNAME(TPNS0226)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0227)    NETNAME(TPNS0227)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0228)    NETNAME(TPNS0228)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0229)    NETNAME(TPNS0229)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0230)    NETNAME(TPNS0230)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0231)    NETNAME(TPNS0231)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0232)    NETNAME(TPNS0232)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0233)    NETNAME(TPNS0233)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0234)    NETNAME(TPNS0234)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0235)    NETNAME(TPNS0235)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0236)    NETNAME(TPNS0236)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0237)    NETNAME(TPNS0237)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0238)    NETNAME(TPNS0238)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0239)    NETNAME(TPNS0239)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0240)    NETNAME(TPNS0240)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0241)    NETNAME(TPNS0241)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0242)    NETNAME(TPNS0242)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0243)    NETNAME(TPNS0243)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0244)    NETNAME(TPNS0244)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0245)    NETNAME(TPNS0245)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0246)    NETNAME(TPNS0246)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0247)    NETNAME(TPNS0247)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0248)    NETNAME(TPNS0248)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0249)    NETNAME(TPNS0249)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0250)    NETNAME(TPNS0250)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0251)    NETNAME(TPNS0251)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0252)    NETNAME(TPNS0252)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0253)    NETNAME(TPNS0253)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0254)    NETNAME(TPNS0254)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0255)    NETNAME(TPNS0255)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0256)    NETNAME(TPNS0256)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0257)    NETNAME(TPNS0257)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0258)    NETNAME(TPNS0258)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0259)    NETNAME(TPNS0259)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0260)    NETNAME(TPNS0260)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0261)    NETNAME(TPNS0261)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0262)    NETNAME(TPNS0262)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0263)    NETNAME(TPNS0263)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0264)    NETNAME(TPNS0264)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0265)    NETNAME(TPNS0265)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0266)    NETNAME(TPNS0266)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0267)    NETNAME(TPNS0267)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0268)    NETNAME(TPNS0268)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0269)    NETNAME(TPNS0269)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0270)    NETNAME(TPNS0270)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0271)    NETNAME(TPNS0271)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0272)    NETNAME(TPNS0272)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0273)    NETNAME(TPNS0273)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0274)    NETNAME(TPNS0274)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0275)    NETNAME(TPNS0275)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0276)    NETNAME(TPNS0276)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0277)    NETNAME(TPNS0277)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0278)    NETNAME(TPNS0278)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0279)    NETNAME(TPNS0279)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0280)    NETNAME(TPNS0280)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0281)    NETNAME(TPNS0281)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0282)    NETNAME(TPNS0282)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0283)    NETNAME(TPNS0283)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0284)    NETNAME(TPNS0284)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0285)    NETNAME(TPNS0285)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0286)    NETNAME(TPNS0286)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0287)    NETNAME(TPNS0287)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0288)    NETNAME(TPNS0288)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0289)    NETNAME(TPNS0289)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0290)    NETNAME(TPNS0290)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0291)    NETNAME(TPNS0291)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0292)    NETNAME(TPNS0292)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0293)    NETNAME(TPNS0293)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0294)    NETNAME(TPNS0294)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0295)    NETNAME(TPNS0295)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0296)    NETNAME(TPNS0296)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0297)    NETNAME(TPNS0297)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0298)    NETNAME(TPNS0298)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0299)    NETNAME(TPNS0299)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0300)    NETNAME(TPNS0300)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0301)    NETNAME(TPNS0301)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0302)    NETNAME(TPNS0302)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0303)    NETNAME(TPNS0303)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0304)    NETNAME(TPNS0304)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0305)    NETNAME(TPNS0305)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0306)    NETNAME(TPNS0306)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0307)    NETNAME(TPNS0307)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0308)    NETNAME(TPNS0308)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0309)    NETNAME(TPNS0309)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0310)    NETNAME(TPNS0310)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0311)    NETNAME(TPNS0311)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0312)    NETNAME(TPNS0312)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0313)    NETNAME(TPNS0313)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0314)    NETNAME(TPNS0314)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0315)    NETNAME(TPNS0315)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0316)    NETNAME(TPNS0316)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0317)    NETNAME(TPNS0317)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0318)    NETNAME(TPNS0318)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0319)    NETNAME(TPNS0319)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0320)    NETNAME(TPNS0320)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0321)    NETNAME(TPNS0321)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0322)    NETNAME(TPNS0322)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0323)    NETNAME(TPNS0323)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0324)    NETNAME(TPNS0324)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0325)    NETNAME(TPNS0325)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0326)    NETNAME(TPNS0326)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0327)    NETNAME(TPNS0327)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0328)    NETNAME(TPNS0328)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0329)    NETNAME(TPNS0329)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0330)    NETNAME(TPNS0330)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0331)    NETNAME(TPNS0331)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0332)    NETNAME(TPNS0332)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0333)    NETNAME(TPNS0333)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0334)    NETNAME(TPNS0334)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0335)    NETNAME(TPNS0335)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0336)    NETNAME(TPNS0336)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0337)    NETNAME(TPNS0337)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0338)    NETNAME(TPNS0338)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0339)    NETNAME(TPNS0339)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0340)    NETNAME(TPNS0340)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0341)    NETNAME(TPNS0341)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0342)    NETNAME(TPNS0342)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0343)    NETNAME(TPNS0343)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0344)    NETNAME(TPNS0344)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0345)    NETNAME(TPNS0345)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0346)    NETNAME(TPNS0346)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0347)    NETNAME(TPNS0347)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0348)    NETNAME(TPNS0348)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0349)    NETNAME(TPNS0349)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0350)    NETNAME(TPNS0350)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0351)    NETNAME(TPNS0351)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0352)    NETNAME(TPNS0352)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0353)    NETNAME(TPNS0353)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0354)    NETNAME(TPNS0354)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0355)    NETNAME(TPNS0355)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0356)    NETNAME(TPNS0356)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0357)    NETNAME(TPNS0357)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0358)    NETNAME(TPNS0358)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0359)    NETNAME(TPNS0359)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0360)    NETNAME(TPNS0360)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0361)    NETNAME(TPNS0361)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0362)    NETNAME(TPNS0362)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0363)    NETNAME(TPNS0363)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0364)    NETNAME(TPNS0364)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0365)    NETNAME(TPNS0365)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0366)    NETNAME(TPNS0366)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0367)    NETNAME(TPNS0367)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0368)    NETNAME(TPNS0368)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0369)    NETNAME(TPNS0369)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0370)    NETNAME(TPNS0370)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0371)    NETNAME(TPNS0371)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0372)    NETNAME(TPNS0372)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0373)    NETNAME(TPNS0373)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0374)    NETNAME(TPNS0374)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0375)    NETNAME(TPNS0375)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0376)    NETNAME(TPNS0376)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0377)    NETNAME(TPNS0377)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0378)    NETNAME(TPNS0378)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0379)    NETNAME(TPNS0379)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0380)    NETNAME(TPNS0380)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0381)    NETNAME(TPNS0381)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0382)    NETNAME(TPNS0382)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0383)    NETNAME(TPNS0383)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0384)    NETNAME(TPNS0384)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0385)    NETNAME(TPNS0385)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0386)    NETNAME(TPNS0386)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0387)    NETNAME(TPNS0387)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0388)    NETNAME(TPNS0388)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0389)    NETNAME(TPNS0389)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0390)    NETNAME(TPNS0390)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0391)    NETNAME(TPNS0391)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0392)    NETNAME(TPNS0392)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0393)    NETNAME(TPNS0393)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0394)    NETNAME(TPNS0394)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0395)    NETNAME(TPNS0395)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0396)    NETNAME(TPNS0396)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0397)    NETNAME(TPNS0397)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0398)    NETNAME(TPNS0398)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0399)    NETNAME(TPNS0399)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0400)    NETNAME(TPNS0400)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0401)    NETNAME(TPNS0401)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0402)    NETNAME(TPNS0402)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0403)    NETNAME(TPNS0403)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0404)    NETNAME(TPNS0404)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0405)    NETNAME(TPNS0405)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0406)    NETNAME(TPNS0406)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0407)    NETNAME(TPNS0407)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0408)    NETNAME(TPNS0408)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0409)    NETNAME(TPNS0409)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0410)    NETNAME(TPNS0410)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0411)    NETNAME(TPNS0411)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0412)    NETNAME(TPNS0412)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0413)    NETNAME(TPNS0413)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0414)    NETNAME(TPNS0414)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0415)    NETNAME(TPNS0415)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0416)    NETNAME(TPNS0416)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0417)    NETNAME(TPNS0417)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0418)    NETNAME(TPNS0418)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0419)    NETNAME(TPNS0419)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0420)    NETNAME(TPNS0420)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0421)    NETNAME(TPNS0421)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0422)    NETNAME(TPNS0422)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0423)    NETNAME(TPNS0423)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0424)    NETNAME(TPNS0424)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0425)    NETNAME(TPNS0425)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0426)    NETNAME(TPNS0426)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0427)    NETNAME(TPNS0427)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0428)    NETNAME(TPNS0428)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0429)    NETNAME(TPNS0429)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0430)    NETNAME(TPNS0430)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0431)    NETNAME(TPNS0431)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0432)    NETNAME(TPNS0432)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0433)    NETNAME(TPNS0433)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0434)    NETNAME(TPNS0434)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0435)    NETNAME(TPNS0435)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0436)    NETNAME(TPNS0436)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0437)    NETNAME(TPNS0437)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0438)    NETNAME(TPNS0438)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0439)    NETNAME(TPNS0439)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0440)    NETNAME(TPNS0440)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0441)    NETNAME(TPNS0441)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0442)    NETNAME(TPNS0442)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0443)    NETNAME(TPNS0443)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0444)    NETNAME(TPNS0444)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0445)    NETNAME(TPNS0445)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0446)    NETNAME(TPNS0446)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0447)    NETNAME(TPNS0447)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0448)    NETNAME(TPNS0448)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0449)    NETNAME(TPNS0449)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0450)    NETNAME(TPNS0450)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0451)    NETNAME(TPNS0451)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0452)    NETNAME(TPNS0452)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0453)    NETNAME(TPNS0453)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0454)    NETNAME(TPNS0454)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0455)    NETNAME(TPNS0455)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0456)    NETNAME(TPNS0456)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0457)    NETNAME(TPNS0457)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0458)    NETNAME(TPNS0458)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0459)    NETNAME(TPNS0459)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0460)    NETNAME(TPNS0460)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0461)    NETNAME(TPNS0461)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0462)    NETNAME(TPNS0462)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0463)    NETNAME(TPNS0463)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0464)    NETNAME(TPNS0464)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0465)    NETNAME(TPNS0465)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0466)    NETNAME(TPNS0466)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0467)    NETNAME(TPNS0467)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0468)    NETNAME(TPNS0468)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0469)    NETNAME(TPNS0469)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0470)    NETNAME(TPNS0470)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0471)    NETNAME(TPNS0471)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0472)    NETNAME(TPNS0472)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0473)    NETNAME(TPNS0473)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0474)    NETNAME(TPNS0474)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0475)    NETNAME(TPNS0475)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0476)    NETNAME(TPNS0476)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0477)    NETNAME(TPNS0477)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0478)    NETNAME(TPNS0478)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0479)    NETNAME(TPNS0479)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0480)    NETNAME(TPNS0480)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0481)    NETNAME(TPNS0481)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0482)    NETNAME(TPNS0482)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0483)    NETNAME(TPNS0483)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0484)    NETNAME(TPNS0484)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0485)    NETNAME(TPNS0485)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0486)    NETNAME(TPNS0486)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0487)    NETNAME(TPNS0487)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0488)    NETNAME(TPNS0488)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0489)    NETNAME(TPNS0489)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0490)    NETNAME(TPNS0490)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0491)    NETNAME(TPNS0491)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0492)    NETNAME(TPNS0492)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0493)    NETNAME(TPNS0493)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0494)    NETNAME(TPNS0494)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0495)    NETNAME(TPNS0495)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0496)    NETNAME(TPNS0496)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0497)    NETNAME(TPNS0497)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0498)    NETNAME(TPNS0498)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0499)    NETNAME(TPNS0499)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0500)    NETNAME(TPNS0500)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0501)    NETNAME(TPNS0501)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0502)    NETNAME(TPNS0502)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0503)    NETNAME(TPNS0503)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0504)    NETNAME(TPNS0504)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0505)    NETNAME(TPNS0505)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0506)    NETNAME(TPNS0506)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0507)    NETNAME(TPNS0507)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0508)    NETNAME(TPNS0508)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0509)    NETNAME(TPNS0509)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0510)    NETNAME(TPNS0510)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0511)    NETNAME(TPNS0511)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0512)    NETNAME(TPNS0512)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0513)    NETNAME(TPNS0513)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0514)    NETNAME(TPNS0514)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0515)    NETNAME(TPNS0515)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0516)    NETNAME(TPNS0516)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0517)    NETNAME(TPNS0517)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0518)    NETNAME(TPNS0518)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0519)    NETNAME(TPNS0519)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0520)    NETNAME(TPNS0520)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0521)    NETNAME(TPNS0521)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0522)    NETNAME(TPNS0522)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0523)    NETNAME(TPNS0523)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0524)    NETNAME(TPNS0524)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0525)    NETNAME(TPNS0525)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0526)    NETNAME(TPNS0526)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0527)    NETNAME(TPNS0527)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0528)    NETNAME(TPNS0528)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0529)    NETNAME(TPNS0529)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0530)    NETNAME(TPNS0530)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0531)    NETNAME(TPNS0531)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0532)    NETNAME(TPNS0532)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0533)    NETNAME(TPNS0533)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0534)    NETNAME(TPNS0534)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0535)    NETNAME(TPNS0535)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0536)    NETNAME(TPNS0536)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0537)    NETNAME(TPNS0537)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0538)    NETNAME(TPNS0538)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0539)    NETNAME(TPNS0539)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0540)    NETNAME(TPNS0540)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0541)    NETNAME(TPNS0541)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0542)    NETNAME(TPNS0542)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0543)    NETNAME(TPNS0543)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0544)    NETNAME(TPNS0544)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0545)    NETNAME(TPNS0545)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0546)    NETNAME(TPNS0546)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0547)    NETNAME(TPNS0547)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0548)    NETNAME(TPNS0548)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0549)    NETNAME(TPNS0549)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0550)    NETNAME(TPNS0550)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0551)    NETNAME(TPNS0551)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0552)    NETNAME(TPNS0552)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0553)    NETNAME(TPNS0553)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0554)    NETNAME(TPNS0554)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0555)    NETNAME(TPNS0555)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0556)    NETNAME(TPNS0556)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0557)    NETNAME(TPNS0557)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0558)    NETNAME(TPNS0558)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0559)    NETNAME(TPNS0559)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0560)    NETNAME(TPNS0560)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0561)    NETNAME(TPNS0561)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0562)    NETNAME(TPNS0562)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0563)    NETNAME(TPNS0563)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0564)    NETNAME(TPNS0564)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0565)    NETNAME(TPNS0565)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0566)    NETNAME(TPNS0566)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0567)    NETNAME(TPNS0567)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0568)    NETNAME(TPNS0568)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0569)    NETNAME(TPNS0569)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0570)    NETNAME(TPNS0570)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0571)    NETNAME(TPNS0571)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0572)    NETNAME(TPNS0572)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0573)    NETNAME(TPNS0573)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0574)    NETNAME(TPNS0574)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0575)    NETNAME(TPNS0575)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0576)    NETNAME(TPNS0576)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0577)    NETNAME(TPNS0577)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0578)    NETNAME(TPNS0578)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0579)    NETNAME(TPNS0579)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0580)    NETNAME(TPNS0580)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0581)    NETNAME(TPNS0581)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0582)    NETNAME(TPNS0582)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0583)    NETNAME(TPNS0583)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0584)    NETNAME(TPNS0584)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0585)    NETNAME(TPNS0585)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0586)    NETNAME(TPNS0586)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0587)    NETNAME(TPNS0587)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0588)    NETNAME(TPNS0588)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0589)    NETNAME(TPNS0589)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0590)    NETNAME(TPNS0590)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0591)    NETNAME(TPNS0591)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0592)    NETNAME(TPNS0592)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0593)    NETNAME(TPNS0593)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0594)    NETNAME(TPNS0594)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0595)    NETNAME(TPNS0595)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0596)    NETNAME(TPNS0596)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0597)    NETNAME(TPNS0597)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0598)    NETNAME(TPNS0598)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0599)    NETNAME(TPNS0599)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0600)    NETNAME(TPNS0600)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0601)    NETNAME(TPNS0601)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0602)    NETNAME(TPNS0602)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0603)    NETNAME(TPNS0603)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0604)    NETNAME(TPNS0604)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0605)    NETNAME(TPNS0605)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0606)    NETNAME(TPNS0606)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0607)    NETNAME(TPNS0607)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0608)    NETNAME(TPNS0608)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0609)    NETNAME(TPNS0609)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0610)    NETNAME(TPNS0610)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0611)    NETNAME(TPNS0611)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0612)    NETNAME(TPNS0612)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0613)    NETNAME(TPNS0613)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0614)    NETNAME(TPNS0614)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0615)    NETNAME(TPNS0615)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0616)    NETNAME(TPNS0616)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0617)    NETNAME(TPNS0617)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0618)    NETNAME(TPNS0618)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0619)    NETNAME(TPNS0619)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0620)    NETNAME(TPNS0620)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0621)    NETNAME(TPNS0621)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0622)    NETNAME(TPNS0622)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0623)    NETNAME(TPNS0623)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0624)    NETNAME(TPNS0624)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0625)    NETNAME(TPNS0625)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0626)    NETNAME(TPNS0626)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0627)    NETNAME(TPNS0627)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0628)    NETNAME(TPNS0628)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0629)    NETNAME(TPNS0629)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0630)    NETNAME(TPNS0630)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0631)    NETNAME(TPNS0631)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0632)    NETNAME(TPNS0632)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0633)    NETNAME(TPNS0633)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0634)    NETNAME(TPNS0634)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0635)    NETNAME(TPNS0635)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0636)    NETNAME(TPNS0636)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0637)    NETNAME(TPNS0637)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0638)    NETNAME(TPNS0638)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0639)    NETNAME(TPNS0639)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0640)    NETNAME(TPNS0640)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0641)    NETNAME(TPNS0641)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0642)    NETNAME(TPNS0642)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0643)    NETNAME(TPNS0643)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0644)    NETNAME(TPNS0644)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0645)    NETNAME(TPNS0645)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0646)    NETNAME(TPNS0646)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0647)    NETNAME(TPNS0647)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0648)    NETNAME(TPNS0648)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0649)    NETNAME(TPNS0649)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0650)    NETNAME(TPNS0650)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0651)    NETNAME(TPNS0651)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0652)    NETNAME(TPNS0652)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0653)    NETNAME(TPNS0653)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0654)    NETNAME(TPNS0654)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0655)    NETNAME(TPNS0655)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0656)    NETNAME(TPNS0656)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0657)    NETNAME(TPNS0657)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0658)    NETNAME(TPNS0658)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0659)    NETNAME(TPNS0659)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0660)    NETNAME(TPNS0660)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0661)    NETNAME(TPNS0661)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0662)    NETNAME(TPNS0662)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0663)    NETNAME(TPNS0663)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0664)    NETNAME(TPNS0664)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0665)    NETNAME(TPNS0665)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0666)    NETNAME(TPNS0666)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0667)    NETNAME(TPNS0667)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0668)    NETNAME(TPNS0668)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0669)    NETNAME(TPNS0669)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0670)    NETNAME(TPNS0670)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0671)    NETNAME(TPNS0671)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0672)    NETNAME(TPNS0672)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0673)    NETNAME(TPNS0673)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0674)    NETNAME(TPNS0674)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0675)    NETNAME(TPNS0675)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0676)    NETNAME(TPNS0676)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0677)    NETNAME(TPNS0677)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0678)    NETNAME(TPNS0678)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0679)    NETNAME(TPNS0679)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0680)    NETNAME(TPNS0680)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0681)    NETNAME(TPNS0681)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0682)    NETNAME(TPNS0682)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0683)    NETNAME(TPNS0683)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0684)    NETNAME(TPNS0684)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0685)    NETNAME(TPNS0685)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0686)    NETNAME(TPNS0686)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0687)    NETNAME(TPNS0687)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0688)    NETNAME(TPNS0688)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0689)    NETNAME(TPNS0689)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0690)    NETNAME(TPNS0690)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0691)    NETNAME(TPNS0691)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0692)    NETNAME(TPNS0692)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0693)    NETNAME(TPNS0693)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0694)    NETNAME(TPNS0694)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0695)    NETNAME(TPNS0695)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0696)    NETNAME(TPNS0696)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0697)    NETNAME(TPNS0697)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0698)    NETNAME(TPNS0698)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0699)    NETNAME(TPNS0699)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0700)    NETNAME(TPNS0700)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0701)    NETNAME(TPNS0701)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0702)    NETNAME(TPNS0702)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0703)    NETNAME(TPNS0703)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0704)    NETNAME(TPNS0704)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0705)    NETNAME(TPNS0705)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0706)    NETNAME(TPNS0706)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0707)    NETNAME(TPNS0707)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0708)    NETNAME(TPNS0708)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0709)    NETNAME(TPNS0709)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0710)    NETNAME(TPNS0710)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0711)    NETNAME(TPNS0711)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0712)    NETNAME(TPNS0712)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0713)    NETNAME(TPNS0713)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0714)    NETNAME(TPNS0714)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0715)    NETNAME(TPNS0715)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0716)    NETNAME(TPNS0716)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0717)    NETNAME(TPNS0717)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0718)    NETNAME(TPNS0718)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0719)    NETNAME(TPNS0719)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0720)    NETNAME(TPNS0720)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0721)    NETNAME(TPNS0721)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0722)    NETNAME(TPNS0722)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0723)    NETNAME(TPNS0723)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0724)    NETNAME(TPNS0724)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0725)    NETNAME(TPNS0725)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0726)    NETNAME(TPNS0726)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0727)    NETNAME(TPNS0727)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0728)    NETNAME(TPNS0728)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0729)    NETNAME(TPNS0729)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0730)    NETNAME(TPNS0730)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0731)    NETNAME(TPNS0731)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0732)    NETNAME(TPNS0732)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0733)    NETNAME(TPNS0733)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0734)    NETNAME(TPNS0734)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0735)    NETNAME(TPNS0735)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0736)    NETNAME(TPNS0736)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0737)    NETNAME(TPNS0737)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0738)    NETNAME(TPNS0738)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0739)    NETNAME(TPNS0739)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0740)    NETNAME(TPNS0740)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0741)    NETNAME(TPNS0741)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0742)    NETNAME(TPNS0742)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0743)    NETNAME(TPNS0743)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0744)    NETNAME(TPNS0744)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0745)    NETNAME(TPNS0745)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0746)    NETNAME(TPNS0746)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0747)    NETNAME(TPNS0747)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0748)    NETNAME(TPNS0748)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0749)    NETNAME(TPNS0749)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0750)    NETNAME(TPNS0750)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0751)    NETNAME(TPNS0751)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0752)    NETNAME(TPNS0752)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0753)    NETNAME(TPNS0753)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0754)    NETNAME(TPNS0754)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0755)    NETNAME(TPNS0755)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0756)    NETNAME(TPNS0756)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0757)    NETNAME(TPNS0757)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0758)    NETNAME(TPNS0758)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0759)    NETNAME(TPNS0759)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0760)    NETNAME(TPNS0760)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0761)    NETNAME(TPNS0761)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0762)    NETNAME(TPNS0762)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0763)    NETNAME(TPNS0763)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0764)    NETNAME(TPNS0764)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0765)    NETNAME(TPNS0765)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0766)    NETNAME(TPNS0766)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0767)    NETNAME(TPNS0767)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0768)    NETNAME(TPNS0768)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0769)    NETNAME(TPNS0769)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0770)    NETNAME(TPNS0770)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0771)    NETNAME(TPNS0771)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0772)    NETNAME(TPNS0772)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0773)    NETNAME(TPNS0773)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0774)    NETNAME(TPNS0774)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0775)    NETNAME(TPNS0775)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0776)    NETNAME(TPNS0776)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0777)    NETNAME(TPNS0777)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0778)    NETNAME(TPNS0778)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0779)    NETNAME(TPNS0779)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0780)    NETNAME(TPNS0780)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0781)    NETNAME(TPNS0781)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0782)    NETNAME(TPNS0782)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0783)    NETNAME(TPNS0783)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0784)    NETNAME(TPNS0784)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0785)    NETNAME(TPNS0785)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0786)    NETNAME(TPNS0786)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0787)    NETNAME(TPNS0787)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0788)    NETNAME(TPNS0788)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0789)    NETNAME(TPNS0789)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0790)    NETNAME(TPNS0790)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0791)    NETNAME(TPNS0791)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0792)    NETNAME(TPNS0792)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0793)    NETNAME(TPNS0793)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0794)    NETNAME(TPNS0794)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0795)    NETNAME(TPNS0795)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0796)    NETNAME(TPNS0796)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0797)    NETNAME(TPNS0797)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0798)    NETNAME(TPNS0798)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0799)    NETNAME(TPNS0799)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0800)    NETNAME(TPNS0800)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0801)    NETNAME(TPNS0801)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0802)    NETNAME(TPNS0802)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0803)    NETNAME(TPNS0803)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0804)    NETNAME(TPNS0804)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0805)    NETNAME(TPNS0805)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0806)    NETNAME(TPNS0806)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0807)    NETNAME(TPNS0807)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0808)    NETNAME(TPNS0808)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0809)    NETNAME(TPNS0809)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0810)    NETNAME(TPNS0810)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0811)    NETNAME(TPNS0811)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0812)    NETNAME(TPNS0812)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0813)    NETNAME(TPNS0813)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0814)    NETNAME(TPNS0814)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0815)    NETNAME(TPNS0815)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0816)    NETNAME(TPNS0816)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0817)    NETNAME(TPNS0817)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0818)    NETNAME(TPNS0818)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0819)    NETNAME(TPNS0819)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0820)    NETNAME(TPNS0820)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0821)    NETNAME(TPNS0821)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0822)    NETNAME(TPNS0822)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0823)    NETNAME(TPNS0823)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0824)    NETNAME(TPNS0824)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0825)    NETNAME(TPNS0825)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0826)    NETNAME(TPNS0826)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0827)    NETNAME(TPNS0827)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0828)    NETNAME(TPNS0828)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0829)    NETNAME(TPNS0829)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0830)    NETNAME(TPNS0830)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0831)    NETNAME(TPNS0831)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0832)    NETNAME(TPNS0832)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0833)    NETNAME(TPNS0833)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0834)    NETNAME(TPNS0834)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0835)    NETNAME(TPNS0835)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0836)    NETNAME(TPNS0836)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0837)    NETNAME(TPNS0837)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0838)    NETNAME(TPNS0838)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0839)    NETNAME(TPNS0839)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0840)    NETNAME(TPNS0840)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0841)    NETNAME(TPNS0841)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0842)    NETNAME(TPNS0842)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0843)    NETNAME(TPNS0843)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0844)    NETNAME(TPNS0844)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0845)    NETNAME(TPNS0845)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0846)    NETNAME(TPNS0846)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0847)    NETNAME(TPNS0847)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0848)    NETNAME(TPNS0848)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0849)    NETNAME(TPNS0849)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0850)    NETNAME(TPNS0850)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0851)    NETNAME(TPNS0851)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0852)    NETNAME(TPNS0852)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0853)    NETNAME(TPNS0853)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0854)    NETNAME(TPNS0854)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0855)    NETNAME(TPNS0855)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0856)    NETNAME(TPNS0856)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0857)    NETNAME(TPNS0857)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0858)    NETNAME(TPNS0858)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0859)    NETNAME(TPNS0859)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0860)    NETNAME(TPNS0860)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0861)    NETNAME(TPNS0861)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0862)    NETNAME(TPNS0862)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0863)    NETNAME(TPNS0863)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0864)    NETNAME(TPNS0864)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0865)    NETNAME(TPNS0865)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0866)    NETNAME(TPNS0866)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0867)    NETNAME(TPNS0867)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0868)    NETNAME(TPNS0868)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0869)    NETNAME(TPNS0869)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0870)    NETNAME(TPNS0870)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0871)    NETNAME(TPNS0871)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0872)    NETNAME(TPNS0872)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0873)    NETNAME(TPNS0873)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0874)    NETNAME(TPNS0874)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0875)    NETNAME(TPNS0875)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0876)    NETNAME(TPNS0876)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0877)    NETNAME(TPNS0877)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0878)    NETNAME(TPNS0878)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0879)    NETNAME(TPNS0879)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0880)    NETNAME(TPNS0880)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0881)    NETNAME(TPNS0881)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0882)    NETNAME(TPNS0882)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0883)    NETNAME(TPNS0883)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0884)    NETNAME(TPNS0884)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0885)    NETNAME(TPNS0885)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0886)    NETNAME(TPNS0886)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0887)    NETNAME(TPNS0887)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0888)    NETNAME(TPNS0888)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0889)    NETNAME(TPNS0889)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0890)    NETNAME(TPNS0890)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0891)    NETNAME(TPNS0891)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0892)    NETNAME(TPNS0892)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0893)    NETNAME(TPNS0893)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0894)    NETNAME(TPNS0894)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0895)    NETNAME(TPNS0895)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0896)    NETNAME(TPNS0896)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0897)    NETNAME(TPNS0897)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0898)    NETNAME(TPNS0898)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0899)    NETNAME(TPNS0899)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0900)    NETNAME(TPNS0900)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0901)    NETNAME(TPNS0901)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0902)    NETNAME(TPNS0902)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0903)    NETNAME(TPNS0903)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0904)    NETNAME(TPNS0904)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0905)    NETNAME(TPNS0905)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0906)    NETNAME(TPNS0906)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0907)    NETNAME(TPNS0907)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0908)    NETNAME(TPNS0908)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0909)    NETNAME(TPNS0909)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0910)    NETNAME(TPNS0910)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0911)    NETNAME(TPNS0911)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0912)    NETNAME(TPNS0912)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0913)    NETNAME(TPNS0913)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0914)    NETNAME(TPNS0914)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0915)    NETNAME(TPNS0915)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0916)    NETNAME(TPNS0916)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0917)    NETNAME(TPNS0917)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0918)    NETNAME(TPNS0918)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0919)    NETNAME(TPNS0919)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0920)    NETNAME(TPNS0920)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0921)    NETNAME(TPNS0921)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0922)    NETNAME(TPNS0922)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0923)    NETNAME(TPNS0923)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0924)    NETNAME(TPNS0924)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0925)    NETNAME(TPNS0925)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0926)    NETNAME(TPNS0926)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0927)    NETNAME(TPNS0927)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0928)    NETNAME(TPNS0928)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0929)    NETNAME(TPNS0929)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0930)    NETNAME(TPNS0930)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0931)    NETNAME(TPNS0931)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0932)    NETNAME(TPNS0932)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0933)    NETNAME(TPNS0933)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0934)    NETNAME(TPNS0934)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0935)    NETNAME(TPNS0935)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0936)    NETNAME(TPNS0936)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0937)    NETNAME(TPNS0937)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0938)    NETNAME(TPNS0938)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0939)    NETNAME(TPNS0939)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0940)    NETNAME(TPNS0940)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0941)    NETNAME(TPNS0941)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0942)    NETNAME(TPNS0942)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0943)    NETNAME(TPNS0943)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0944)    NETNAME(TPNS0944)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0945)    NETNAME(TPNS0945)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0946)    NETNAME(TPNS0946)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0947)    NETNAME(TPNS0947)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0948)    NETNAME(TPNS0948)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0949)    NETNAME(TPNS0949)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0950)    NETNAME(TPNS0950)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0951)    NETNAME(TPNS0951)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0952)    NETNAME(TPNS0952)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0953)    NETNAME(TPNS0953)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0954)    NETNAME(TPNS0954)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0955)    NETNAME(TPNS0955)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0956)    NETNAME(TPNS0956)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0957)    NETNAME(TPNS0957)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0958)    NETNAME(TPNS0958)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0959)    NETNAME(TPNS0959)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0960)    NETNAME(TPNS0960)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0961)    NETNAME(TPNS0961)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0962)    NETNAME(TPNS0962)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0963)    NETNAME(TPNS0963)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0964)    NETNAME(TPNS0964)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0965)    NETNAME(TPNS0965)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0966)    NETNAME(TPNS0966)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0967)    NETNAME(TPNS0967)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0968)    NETNAME(TPNS0968)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0969)    NETNAME(TPNS0969)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0970)    NETNAME(TPNS0970)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0971)    NETNAME(TPNS0971)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0972)    NETNAME(TPNS0972)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0973)    NETNAME(TPNS0973)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0974)    NETNAME(TPNS0974)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0975)    NETNAME(TPNS0975)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0976)    NETNAME(TPNS0976)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0977)    NETNAME(TPNS0977)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0978)    NETNAME(TPNS0978)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0979)    NETNAME(TPNS0979)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0980)    NETNAME(TPNS0980)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0981)    NETNAME(TPNS0981)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0982)    NETNAME(TPNS0982)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0983)    NETNAME(TPNS0983)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0984)    NETNAME(TPNS0984)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0985)    NETNAME(TPNS0985)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0986)    NETNAME(TPNS0986)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0987)    NETNAME(TPNS0987)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0988)    NETNAME(TPNS0988)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0989)    NETNAME(TPNS0989)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0990)    NETNAME(TPNS0990)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0991)    NETNAME(TPNS0991)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0992)    NETNAME(TPNS0992)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0993)    NETNAME(TPNS0993)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0994)    NETNAME(TPNS0994)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0995)    NETNAME(TPNS0995)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0996)    NETNAME(TPNS0996)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0997)    NETNAME(TPNS0997)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0998)    NETNAME(TPNS0998)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(0999)    NETNAME(TPNS0999)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*                                                                               
DEFINE TERMINAL(1000)    NETNAME(TPNS5000)     GROUP(CRTS)                      
       TYPETERM(LU2)     AUTINSTMODEL(NO)                                       
*/********************************************************************/         
*/*                                                                  */         
*/*  LICENSED MATERIALS - PROPERTY OF IBM                            */         
*/*                                                                  */         
*/*    5688-198  (C) COPYRIGHT IBM CORP. 1991,  1995                 */         
*/*    ALL RIGHTS RESERVED.                                          */         
*/*                                                                  */         
*/*    US Government Users Restricted Rights - Use, duplication or   */         
*/*    disclosure restricted by GSA ADP Schedule Contract with IBM   */         
*/*    Corp.                                                         */         
*/*                                                                  */         
*/********************************************************************/         
                                                                                
*---------------------------------------------------------------------*         
*                                                                     *         
* LE/370 - CICS CSD Definitions                                       *         
*                                                                     *         
*                                                                     *         
* Note: The group that contains the LE/370 run time routines          *         
*       must be in the group list used during CICS startup.           *         
*                                                                     *         
*---------------------------------------------------------------------*         
                                                                                
*                                                                               
* Common run time routines                                                      
*                                                                               
  DEFINE PROGRAM(CEECCICS) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEECDATX) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEPLPKA) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEVHEAP) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEMMS)   GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEQMATH) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEYDTS)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEKDS)   GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEELCLE)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEMENU0) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEMENU2) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEMENU3) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEMUEN0) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEMUEN2) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEMUEN3) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEMJPN0) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEMJPN2) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEMJPN3) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
*                                                                               
* COBOL specific run time routines                                              
*                                                                               
  DEFINE PROGRAM(CEEEV005) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCPCC)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCPAC)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IIGZMSGT) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCMGEN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCMGUE) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCACS)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCANE)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCANF)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCBID)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCBUG)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCCLS)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCCTL)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCCVB)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCFCC)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCFDP)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCFDW)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCFPW)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCHCM)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCIDB)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCINS)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCIN1)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCIN2)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCIPS)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCIVL)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCLDL)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCLDR)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCLLM)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCLNK)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCMED)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCMSG)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCNMV)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCONV)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCPPL)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCPRC)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCPRS)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCRCL)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCREV)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCRSU)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCSCH)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCSMV)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCSPC)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCSPM)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCSSN)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCSSR)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCSTA)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCSTG)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCXPR)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCUPL)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCUST)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCVLD)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCVMO)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCXDI)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCXMU)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZEDCM)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZEINI)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZEMSG)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZEPOP)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZESMG)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZETRM)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZETCL)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZETSU)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZINSH)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCD2A)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCA2D)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCCAL)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IGZCMGJA) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
*                                                                               
* C/370 CSD Start                                                               
*                                                                               
* C/370 specific run time routines                                              
*                                                                               
 DEFINE PROGRAM(CEEEV003) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCZEMSG) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCZUMSG) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCZJMSG) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCNINSP) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCMSGT)  GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(IEDCMSGT) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$LCNM) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUCSNM) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCHDMNP) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCHDEST) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
*                                                                               
* C/370 compatibility locales                                                   
*                                                                               
 DEFINE PROGRAM(EDC$FRAN) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$GERM) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$ITAL) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$SPAI) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$S370) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$UK)   GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$USA)  GROUP(CEE) LANGUAGE(ASSEMBLER)                        
*                                                                               
* C/370 POSIX-style locales                                                     
*                                                                               
 DEFINE PROGRAM(EDC$DAEE) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$DAEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$DCEO) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$DCEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$DDEB) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$DDEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$EJEX) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$EKEK) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$EKEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$ELES) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$ESEJ) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$ESEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$EUEA) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$EUEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$FBEO) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$FBEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$FCEA) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$FCEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$FFEM) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$FFEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$FIEF) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$FIEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$FSEO) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$FSEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$ISER) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$ISEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$ITEG) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$ITEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$JAEL) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$JAEU) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$JAEV) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$JAEX) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$NBEO) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$NBEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$NNEA) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$NNEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$NOEE) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$NOEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$PTEA) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$PTEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$SVEF) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$SVEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDC$TREW) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
*                                                                               
* C/370 Code set converters                                                     
*                                                                               
 DEFINE PROGRAM(EDCUAAEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUABEL) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUABEN) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUABEU) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUABEV) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUABEX) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUACEL) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUACEN) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUACEU) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUACEV) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUACEX) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEAEO) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEAEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEAI1) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEBEO) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEBEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEBI1) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUECEO) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUECEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUECI1) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEDEO) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEDEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEDI1) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEEEO) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEEEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEEI1) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEFEO) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEFEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEFI1) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEGEO) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEGEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEGI1) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEHEO) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEHEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEHI1) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEIEO) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEIEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEII1) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEJEO) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEJEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEJI1) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEKEO) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEKEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEKI1) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUELAB) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUELAC) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUELEO) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUELEX) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUELEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUELI1) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEMEO) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEMEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEMI1) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUENAB) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUENAC) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEOEA) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEOEB) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEOEC) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEOED) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEOEE) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEOEF) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEOEG) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEOEH) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEOEI) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEOEJ) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEOEK) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEOEL) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEOEM) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEOER) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEOEX) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEOEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEOI1) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEREO) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEREY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUERI1) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUESEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUESI7) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEUAB) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEUAC) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEVAB) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEVAC) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEWEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEWI9) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEXAB) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEXAC) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEXEL) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEXEO) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEXEY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEXI1) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEYAA) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEYEA) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEYEB) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEYEC) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEYED) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEYEE) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEYEF) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEYEG) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEYEH) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEYEI) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEYEJ) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEYEK) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEYEL) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEYEM) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEYEO) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEYER) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEYES) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEYEW) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEYEX) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUEYI1) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUI1EA) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUI1EB) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUI1EC) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUI1ED) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUI1EE) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUI1EF) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUI1EG) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUI1EH) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUI1EI) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUI1EJ) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUI1EK) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUI1EL) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUI1EM) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUI1EO) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUI1ER) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUI1EX) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUI1EY) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUI7ES) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
 DEFINE PROGRAM(EDCUI9EW) GROUP(CEE) LANGUAGE(ASSEMBLER)                        
*                                                                               
* C/370 CSD End                                                                 
*                                                                               
*                                                                               
* PL/I specific run time routines                                               
*                                                                               
  DEFINE PROGRAM(CEEEV010) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBMRSAP)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBMRLIB1) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBMRDMPJ) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBMRDMPM) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBMRDMPU) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBMRKMRA) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBMRLANA) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBMRLANN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBMRLANU) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBMRLNTA) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBMRLNTN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBMRLNTU) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM9LMSA) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM9LMSN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM9LMSU) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM9LM2A) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM9LM2N) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM9LM2U) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IIBMMSGT) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
*                                                                               
* PL/I specific debugger modules                                                
*                                                                               
  DEFINE PROGRAM(IBM3ABF)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3AMI)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3ANL)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3ANX)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3ASD)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3ASK)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3ASN)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3BGE)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3BIF)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3BLK)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3BRN)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3CCD)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3CMD)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3COG)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3CSV)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3CUS)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3DCD)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3DCL)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3DCU)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3DED)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3DEV)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3DLL)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3DPA)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3DSF)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3DSL)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3DST)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3DTP)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3EAB)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3ECO)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3EEX)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3EFB)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3EFD)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3EMC)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3ESL)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3EVB)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3EVC)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3EVX)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3EXP)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3FER)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3FLT)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3FTA)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3FTI)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3FTV)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3GGE)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3GLL)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3GNLA) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3GNLU) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3GNLN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3GQD)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3GQN)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3GRW)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3GTO)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3GVH)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3ICU)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3IDB)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3IDC)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3IDE)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3IDO)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3IDV)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3IEE)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3ILB)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3IMC)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3IMH)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3INP)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3IRC)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3ISL)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3IVH)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3IXE)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3LEXA) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3LEXU) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3LEXN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3LNK)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3LXB)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3MBA)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3MBE)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3MBF)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3MBL)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3MBP)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3MBS)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3MBX)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3NRM)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3OPE)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3PEX)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3PRD)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3QAE)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3QAI)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3QNS)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3QRT)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3QSE)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3QSI)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3QUI)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3REP)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3RIR)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3RSV)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3SBE)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3STR)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3STT)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3TEX)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3UTV)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3UPD)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3VAR)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3VAT)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3VEX)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3VGT)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3VIA)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3VOCA) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3VOCU) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(IBM3VOCN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
*                                                                               
* LE/370 callable services                                                      
*                                                                               
  DEFINE PROGRAM(CEE3ABD)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEE3CIB)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEE3CTY)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEE3DMP)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEE3GRC)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEE3GRN)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEE3LNG)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEE3MCS)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEE3MDS)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEE3MTS)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEE3PRM)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEE3RPH)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEE3SPM)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEE3SRC)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEE3USR)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEECBLDY) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEECMI)   GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEECRHP)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEECZST)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEDATE)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEDATM)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEDAYS)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEDCOD)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEDSHP)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEDYWK)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEFMDA)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEFMDT)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEFMTM)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEFRST)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEGMT)   GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEGMTO)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEGPID)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEGQDT)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEGTST)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEHDLR)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEHDLU)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEISEC)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEITOK)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEELOCT)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEMGET)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEMOUT)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEMRCR)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEMSG)   GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEENCOD)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEQCEN)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEERAN0)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESCEN)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESECI)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESECS)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESGL)   GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEETEST)  GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEEUTC)   GROUP(CEE) LANGUAGE(ASSEMBLER)                       
*                                                                               
* LE/370 math routines                                                          
*                                                                               
  DEFINE PROGRAM(CEESIABS) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSABS) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDABS) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESQABS) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESTABS) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESEABS) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESRABS) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSACS) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDACS) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESQACS) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSASN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDASN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESQASN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSATH) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDATH) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESQATH) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESTATH) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESEATH) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESRATH) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSATN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDATN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESQATN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESTATN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESEATN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESRATN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSAT2) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDAT2) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESQAT2) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESTCJG) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESECJG) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESRCJG) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSCOS) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDCOS) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESQCOS) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESTCOS) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESECOS) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESRCOS) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSCSH) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDCSH) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESQCSH) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESTCSH) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESECSH) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESRCSH) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSCTN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDCTN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESQCTN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESIDIM) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSDIM) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDDIM) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESQDIM) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESTDVD) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESEDVD) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESRDVD) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSERC) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDERC) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESQERC) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSERF) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDERF) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESQERF) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSEXP) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDEXP) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESQEXP) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESTEXP) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESEEXP) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESREXP) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSGMA) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDGMA) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESTIMG) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESEIMG) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESRIMG) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSINT) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDINT) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESQINT) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSLGM) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDLGM) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSLG1) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDLG1) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESQLG1) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSLG2) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDLG2) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESQLG2) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSLOG) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDLOG) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESQLOG) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESTLOG) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESELOG) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESRLOG) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESTMLT) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESEMLT) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESRMLT) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESIMOD) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSMOD) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDMOD) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESQMOD) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSNIN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDNIN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSNWN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDNWN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESISGN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSSGN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDSGN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESQSGN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSSIN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDSIN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESQSIN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESTSIN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESESIN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESRSIN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSSNH) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDSNH) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESQSNH) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESTSNH) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESESNH) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESRSNH) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSSQT) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDSQT) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESQSQT) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESTSQT) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESESQT) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESRSQT) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSTAN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDTAN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESQTAN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESTTAN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESETAN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESRTAN) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSTNH) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDTNH) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESQTNH) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESTTNH) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESETNH) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESRTNH) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESIXPI) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSXPI) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDXPI) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESQXPI) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESTXPI) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESEXPI) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESRXPI) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESSXPS) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESDXPD) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESQXPQ) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESTXPT) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESEXPE) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
  DEFINE PROGRAM(CEESRXPR) GROUP(CEE) LANGUAGE(ASSEMBLER)                       
DEFINE PROGRAM(CIFORMAT)   GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(CFMT) PROGRAM(CIFORMAT) GROUP(DB2GRP)                        
DEFINE PROGRAM(CI2UIT0)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(UIT0) PROGRAM(CI2UIT0) GROUP(DB2GRP)                         
DEFINE PROGRAM(CI2SL00)    GROUP(DB2GRP)     LANGUAGE(COBOL)                    
DEFINE TRANSACTION(SL00) PROGRAM(CI2SL00) GROUP(DB2GRP)                         
*                                                                               
APPEND LIST(DFHLIST) TO(TLIST)                                                  
ADD GROUP(DFHRMI) LIST(TLIST)                                                   
ADD GROUP(CRTS) LIST(TLIST)                                                     
ADD GROUP(DB2GRP) LIST(TLIST)                                                   
ADD GROUP(CEE) LIST(TLIST)                                                      
LIST LIST(TLIST) OBJECTS                                                        
/*                                                                              
//                                                                              
*****************************************************************               
*                                                                               
*                                                                               
* VS COBOL II - CICS CSD DEFINITIONS FOR THE PPT                                
*                                                                               
*                                                                               
* NOTE: THE GROUP THAT CONTAINS THE VS COBOL II RUN TIME ROUTINES               
*       MUST BE IN THE GROUP LIST USED DURING CICS STARTUP.                     
*                                                                               
*****************************************************************               
*                                                                               
*        VS COBOL II COBPACKS                                                   
*                                                                               
*****************************************************************               
  DEFINE PROGRAM(IGZCPAC)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCPCC)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
*****************************************************************               
*                                                                               
*        ANY OF THE FOLLOWING MODULES WHICH ARE IN                              
*        IGZCPAC OR IGZCPCC NEED NOT APPEAR AS A                                
*        SEPARATE ENTRY IN THE PROCESSING PROGRAM TABLE                         
*                                                                               
*****************************************************************               
*****************************************************************               
*                                                               *               
*        VS COBOL II LIBRARY MODULES - NON ESM                  *               
*                                                               *               
*****************************************************************               
  DEFINE PROGRAM(IGZCACS)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCANE)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCANF)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCBID)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCBUG)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCCLS)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCCTL)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCCVB)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCDIF)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCD2A)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCA2D)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCFDP)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCFDW)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCFPW)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCIDB)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCINS)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCIN1)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCIN2)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCIPS)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCIVL)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCLDR)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCLLM)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCLNK)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCMSF)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCMST)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCONV)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCPRC)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCPRS)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCRCL)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCRSU)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCSCH)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCSFT)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCSMV)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCSPC)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCSSN)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCSSR)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCSTG)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCXPR)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZETRM)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCUST)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCVLD)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCVMO)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCXDI)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZCXMU)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
*****************************************************************               
*                                                               *               
*  VS COBOL II LIBRARY MODULES - ENVIRONMENT SPECIFIC FOR CICS  *               
*                                                               *               
*****************************************************************               
  DEFINE PROGRAM(IGZEABN)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZEABX)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZEAFT)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZEBEF)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZEDBG)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZEDBR)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZEDBW)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZEDCM)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZEDXT)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZEGOB)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZEINI)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZELDL)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZEMSG)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZEOPD)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZERID)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZESAT)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZESNP)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZESPM)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZESMG)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZETCL)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZETID)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZETSU)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZETUN)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZEWTO)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
*****************************************************************               
*                                                               *               
*  VS COBOL II LIBRARY MODULES - COBTEST                        *               
*                                                               *               
*****************************************************************               
  DEFINE PROGRAM(COBTEST)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(COBDBG)   GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZTBGT)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZTBMN)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
  DEFINE PROGRAM(IGZTTCL)  GROUP(COBOL2) LANGUAGE(ASSEMBLER)                    
