//DELALIAS JOB (1),'1',NOTIFY=SRD50,MSGCLASS=Y                                  
//IDCAMS EXEC PGM=IDCAMS                                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  DELETE (DJY00) ALIAS                                                          
/*                                                                              
//                                                                              
