//DSMFEC20 JOB (RWM,T),'DUMP',MSGCLASS=Y,NOTIFY=DJY00                   00010000
//*UTPIT OUTPUT DEST=PRT5                                               00011000
//IEFPROC  EXEC PGM=IFASMFDP,REGION=512K                                00012000
//SYSPRINT DD  SYSOUT=*                                                 00013000
//DUMPOUT DD DISP=(NEW,KEEP),DSN=SPARE2.JAN17972.SMFDATA.EC20,          00014008
//    VOL=SER=SPARE2,UNIT=3390,SPACE=(CYL,(5,5))                        00015000
//DUMPIN DD DISP=OLD,DSN=SYS1.EC20.MAN2                                 00016008
