//DSNTEJ1  JOB (330RWM00,),'D J YOUNG',MSGCLASS=Y,REGION=4096K,                 
//       USER=DJY00,NOTIFY=DJY00                                                
//**********************************************************************00010000
//*  NAME = DSNTEJ1                                                    *00020000
//*                                                                    *00030000
//*  DESCRIPTIVE NAME = DB2 SAMPLE APPLICATION                         *00040000
//*                     PHASE 1 (LOCAL SITE ONLY)                      *00050000
//*                                                                    *00060000
//*    LICENSED MATERIALS - PROPERTY OF IBM                            *00070000
//*    5695-DB2                                                        *00080000
//*    (C) COPYRIGHT 1982, 1995 IBM CORP.  ALL RIGHTS RESERVED.        *00090000
//*                                                                    *00100000
//*    STATUS = VERSION 4                                              *00110000
//*                                                                    *00120000
//*  FUNCTION = THIS JCL PERFORMS THE PHASE 1 SETUP FOR THE SAMPLE     *00130000
//*             APPLICATIONS ON A LOCAL DB2 SYSTEM (A SYSTEM WHICH     *00140000
//*             WILL CONTAIN THE ACTUAL SAMPLE TABLES).                *00150000
//*                                                                   */00160000
//* CHANGE ACTIVITY =                                                 */00170000
//**********************************************************************00180000
//*                                                                     00190000
//*       ASMCL PROC  - ASSEMBLE AND LINKEDIT AN ASM PROGRAM            00200000
//*                                                                     00210000
//JOBLIB  DD  DSN=DSN410.SDSNLOAD,DISP=SHR                              00220000
//*                                                                     00230000
//ASMCL  PROC WSPC=500,MEM=TEMPNAME                                     00240000
//*                                                                     00250000
//*            ASSEMBLE                                                 00260000
//*                                                                     00270000
//ASM     EXEC PGM=ASMA90,PARM='OBJECT,NODECK'                          00280000
//SYSIN    DD  DSN=DSN410.SDSNSAMP(&MEM),                               00290000
//             DISP=SHR                                                 00300000
//SYSLIB   DD  DSN=SYS1.MACLIB,DISP=SHR                                 00310000
//         DD  DSN=DSN410.SDSNMACS,DISP=SHR                             00320000
//         DD  DSN=DSN410.SDSNSAMP,DISP=SHR                             00330000
//SYSLIN   DD  DSN=&&LOADSET,DISP=(MOD,PASS),UNIT=3390,                 00340000
//             SPACE=(800,(&WSPC,&WSPC)),DCB=(BLKSIZE=800)              00350000
//SYSPRINT DD  SYSOUT=*                                                 00360000
//SYSUDUMP DD  SYSOUT=*                                                 00370000
//SYSUT1   DD  UNIT=3390,SPACE=(800,(&WSPC,&WSPC),,,ROUND)              00380000
//SYSUT2   DD  UNIT=3390,SPACE=(800,(&WSPC,&WSPC),,,ROUND)              00390000
//SYSUT3   DD  UNIT=3390,SPACE=(800,(&WSPC,&WSPC),,,ROUND)              00400000
//*                                                                     00410000
//*            LINKEDIT IF THE ASSEMBLER                                00420000
//*            RETURN CODE IS 4 OR LESS                                 00430000
//*                                                                     00440000
//LKED    EXEC PGM=IEWL,PARM='LIST,XREF,NCAL',                          00450000
//             COND=(4,LT,ASM)                                          00460000
//SYSLIN   DD  DSN=&&LOADSET,DISP=(OLD,DELETE)                          00470000
//SYSLMOD  DD  DSN=DSN410.SDSNEXIT(&MEM),DISP=SHR                       00480000
//SYSPRINT DD  SYSOUT=*                                                 00490000
//SYSUDUMP DD  SYSOUT=*                                                 00500000
//SYSUT1   DD  UNIT=3390,SPACE=(1024,(50,50))                           00510000
//ASMCL  PEND                                                           00520000
//*                                                                     00530000
//*        STEP  1: CREATE SAMPLE STORAGE GROUPS, TABLESPACES           00540000
//PH01S01 EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)                     00550000
//SYSTSPRT DD SYSOUT=*                                                  00560000
//SYSTSIN  DD *                                                         00570000
 DSN SYSTEM(DB1G)                                                       00580000
 RUN  PROGRAM(DSNTIAD) PLAN(DSNTIA41) -                                 00590000
      LIB('DSN410.RUNLIB.LOAD')                                         00600000
//SYSPRINT DD SYSOUT=*                                                  00610000
//SYSUDUMP DD SYSOUT=*                                                  00620000
//SYSIN    DD *                                                         00630000
                                                                        00640000
CREATE STOGROUP DSN8G410                                                00650000
   VOLUMES ("DB23SY")                                                   00660000
   VCAT  DSN2                                                           00670000
                      ;                                                 00680000
                                                                        00690000
CREATE DATABASE DSN8D41A                                                00700000
   STOGROUP DSN8G410                                                    00710000
   BUFFERPOOL BP0;                                                      00720000
                                                                        00730000
CREATE DATABASE DSN8D41P                                                00740000
   STOGROUP DSN8G410                                                    00750000
   BUFFERPOOL BP0;                                                      00760000
                                                                        00770000
CREATE TABLESPACE DSN8S41D                                              00780000
   IN DSN8D41A                                                          00790000
   USING STOGROUP DSN8G410                                              00800000
             PRIQTY 20                                                  00810000
             SECQTY 20                                                  00820000
             ERASE NO                                                   00830000
   LOCKSIZE PAGE LOCKMAX SYSTEM                                         00840000
   BUFFERPOOL BP0                                                       00850000
   CLOSE NO                                                             00860000
   DSETPASS DSN8;                                                       00870000
                                                                        00880000
COMMIT ;                                                                00890000
                                                                        00900000
CREATE TABLESPACE DSN8S41E                                              00910000
   IN DSN8D41A                                                          00920000
   USING STOGROUP DSN8G410                                              00930000
             PRIQTY 20                                                  00940000
             SECQTY 20                                                  00950000
             ERASE NO                                                   00960000
   NUMPARTS 4                                                           00970000
      (PART 1 USING STOGROUP DSN8G410                                   00980000
                        PRIQTY 12                                       00990000
                        SECQTY 12,                                      01000000
       PART 3 USING STOGROUP DSN8G410                                   01010000
                        PRIQTY 12                                       01020000
                        SECQTY 12)                                      01030000
   LOCKSIZE PAGE LOCKMAX SYSTEM                                         01040000
   BUFFERPOOL BP0                                                       01050000
   CLOSE NO                                                             01060000
   DSETPASS DSN8                                                        01070000
   COMPRESS YES;                                                        01080000
COMMIT ;                                                                01090000
                                                                        01100000
CREATE TABLESPACE DSN8S41C                                              01110000
   IN DSN8D41P                                                          01120000
   USING STOGROUP DSN8G410                                              01130000
             PRIQTY 160                                                 01140000
             SECQTY 80                                                  01150000
   SEGSIZE 4                                                            01160000
   LOCKSIZE TABLE                                                       01170000
   BUFFERPOOL BP0                                                       01180000
   CLOSE NO                                                             01190000
   DSETPASS DSN8;                                                       01200000
                                                                        01210000
COMMIT ;                                                                01220000
                                                                        01230000
CREATE TABLESPACE DSN8S41R                                              01240000
   IN DSN8D41A                                                          01250000
   USING STOGROUP DSN8G410                                              01260000
             PRIQTY 20                                                  01270000
             SECQTY 20                                                  01280000
             ERASE NO                                                   01290000
   LOCKSIZE PAGE LOCKMAX SYSTEM                                         01300000
   BUFFERPOOL BP0                                                       01310000
   CLOSE NO                                                             01320000
   DSETPASS DSN8;                                                       01330000
                                                                        01340000
CREATE TABLESPACE DSN8S41P                                              01350000
   IN DSN8D41A                                                          01360000
   USING STOGROUP DSN8G410                                              01370000
             PRIQTY 160                                                 01380000
             SECQTY 80                                                  01390000
   SEGSIZE 4                                                            01400000
   LOCKSIZE ROW                                                         01410000
   BUFFERPOOL BP0                                                       01420000
   CLOSE NO                                                             01430000
   DSETPASS DSN8;                                                       01440000
                                                                        01450000
COMMIT ;                                                                01460000
                                                                        01470000
CREATE TABLESPACE DSN8S41S                                              01480000
   IN DSN8D41A                                                          01490000
   USING STOGROUP DSN8G410                                              01500000
             PRIQTY 20                                                  01510000
             SECQTY 20                                                  01520000
             ERASE NO                                                   01530000
   LOCKSIZE PAGE LOCKMAX SYSTEM                                         01540000
   BUFFERPOOL BP0                                                       01550000
   CLOSE NO                                                             01560000
   DSETPASS DSN8;                                                       01570000
                                                                        01580000
COMMIT;                                                                 01590000
                                                                        01600000
//*                                                                     01610000
//*        STEP  2: CREATE SAMPLE TABLES, VIEWS                         01620000
//PH01S02 EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)                     01630000
//SYSTSPRT DD  SYSOUT=*                                                 01640000
//SYSTSIN  DD  *                                                        01650000
 DSN SYSTEM(DB1G)                                                       01660000
 RUN  PROGRAM(DSNTIAD) PLAN(DSNTIA41) -                                 01670000
      LIB('DSN410.RUNLIB.LOAD')                                         01680000
//SYSPRINT DD  SYSOUT=*                                                 01690000
//SYSUDUMP DD  SYSOUT=*                                                 01700000
//SYSIN    DD  *                                                        01710000
                                                                        01720000
 CREATE TABLE DSN8410.DEPT                                              01730000
               (DEPTNO   CHAR(3)        NOT NULL,                       01740000
                DEPTNAME VARCHAR(36)    NOT NULL,                       01750000
                MGRNO    CHAR(6)                ,                       01760000
                ADMRDEPT CHAR(3)        NOT NULL,                       01770000
                LOCATION CHAR(16)               ,                       01780000
                PRIMARY KEY(DEPTNO))                                    01790000
        IN DSN8D41A.DSN8S41D;                                           01800000
                                                                        01810000
 CREATE UNIQUE INDEX DSN8410.XDEPT1                                     01820000
                  ON DSN8410.DEPT                                       01830000
                      (DEPTNO   ASC)                                    01840000
                  USING STOGROUP DSN8G410                               01850000
                            PRIQTY 12                                   01860000
                            ERASE NO                                    01870000
                  BUFFERPOOL BP0                                        01880000
                  CLOSE NO                                              01890000
                  DSETPASS DSN8 ;                                       01900000
                                                                        01910000
 CREATE INDEX DSN8410.XDEPT2                                            01920000
                  ON DSN8410.DEPT                                       01930000
                      (MGRNO   ASC)                                     01940000
                  USING STOGROUP DSN8G410                               01950000
                            PRIQTY 12                                   01960000
                            ERASE NO                                    01970000
                  BUFFERPOOL BP0                                        01980000
                  CLOSE NO                                              01990000
                  DSETPASS DSN8 ;                                       02000000
                                                                        02010000
 CREATE TYPE 2 INDEX DSN8410.XDEPT3                                     02020000
                  ON DSN8410.DEPT                                       02030000
                      (ADMRDEPT ASC)                                    02040000
                  USING STOGROUP DSN8G410                               02050000
                            PRIQTY 12                                   02060000
                            ERASE NO                                    02070000
                  BUFFERPOOL BP0                                        02080000
                  CLOSE NO                                              02090000
                  DSETPASS DSN8 ;                                       02100000
                                                                        02110000
 CREATE VIEW DSN8410.VDEPT                                              02120000
    AS SELECT ALL      DEPTNO  ,                                        02130000
                       DEPTNAME,                                        02140000
                       MGRNO   ,                                        02150000
                       ADMRDEPT                                         02160000
    FROM DSN8410.DEPT ;                                                 02170000
                                                                        02180000
 CREATE VIEW DSN8410.VHDEPT                                             02190000
    AS SELECT ALL      DEPTNO  ,                                        02200000
                       DEPTNAME,                                        02210000
                       MGRNO   ,                                        02220000
                       ADMRDEPT,                                        02230000
                       LOCATION                                         02240000
    FROM DSN8410.DEPT ;                                                 02250000
                                                                        02260000
 COMMIT ;                                                               02270000
                                                                        02280000
 CREATE TABLE DSN8410.EMP                                               02290000
               (EMPNO     CHAR(6)        NOT NULL,                      02300000
                FIRSTNME  VARCHAR(12)    NOT NULL,                      02310000
                MIDINIT   CHAR(1)        NOT NULL,                      02320000
                LASTNAME  VARCHAR(15)    NOT NULL,                      02330000
                WORKDEPT  CHAR(3)                ,                      02340000
                PHONENO   CHAR(4) CONSTRAINT NUMBER CHECK               02350000
                 (PHONENO >= '0000' AND PHONENO <= '9999'),             02360000
                HIREDATE  DATE                   ,                      02370000
                JOB       CHAR(8)                ,                      02380000
                EDLEVEL   SMALLINT               ,                      02390000
                SEX       CHAR(1)                ,                      02400000
                BIRTHDATE DATE                   ,                      02410000
                SALARY    DECIMAL(9, 2)          ,                      02420000
                BONUS     DECIMAL(9, 2)          ,                      02430000
                COMM      DECIMAL(9, 2)          ,                      02440000
                PRIMARY KEY(EMPNO),                                     02450000
                FOREIGN KEY RED (WORKDEPT) REFERENCES DSN8410.DEPT      02460000
                  ON DELETE SET NULL)                                   02470000
        EDITPROC  DSN8EAE1                                              02480000
        IN DSN8D41A.DSN8S41E;                                           02490000
                                                                        02500000
 CREATE TYPE 2 UNIQUE INDEX DSN8410.XEMP1                               02510000
                  ON DSN8410.EMP                                        02520000
                      (EMPNO    ASC)                                    02530000
                  USING STOGROUP DSN8G410                               02540000
                            PRIQTY 12                                   02550000
                            ERASE NO                                    02560000
                  CLUSTER                                               02570000
                      (PART 1 VALUES('099999'),                         02580000
                       PART 2 VALUES('199999'),                         02590000
                       PART 3 VALUES('299999'),                         02600000
                       PART 4 VALUES('999999'))                         02610000
                  BUFFERPOOL BP0                                        02620000
                  CLOSE NO                                              02630000
                  DSETPASS DSN8  ;                                      02640000
                                                                        02650000
 CREATE INDEX DSN8410.XEMP2                                             02660000
                  ON DSN8410.EMP                                        02670000
                      (WORKDEPT ASC)                                    02680000
                  USING STOGROUP DSN8G410                               02690000
                            PRIQTY 12                                   02700000
                            ERASE NO                                    02710000
                  BUFFERPOOL BP0                                        02720000
                  CLOSE NO                                              02730000
                  DSETPASS DSN8  ;                                      02740000
                                                                        02750000
 CREATE VIEW DSN8410.VEMP                                               02760000
    AS SELECT ALL      EMPNO   ,                                        02770000
                       FIRSTNME,                                        02780000
                       MIDINIT ,                                        02790000
                       LASTNAME,                                        02800000
                       WORKDEPT                                         02810000
    FROM DSN8410.EMP ;                                                  02820000
                                                                        02830000
 COMMIT ;                                                               02840000
                                                                        02850000
 CREATE TABLE DSN8410.PROJ                                              02860000
               (PROJNO   CHAR(6) PRIMARY KEY NOT NULL,                  02870000
                PROJNAME VARCHAR(24)    NOT NULL WITH DEFAULT           02880000
                  'PROJECT NAME UNDEFINED',                             02890000
                DEPTNO   CHAR(3)        NOT NULL REFERENCES             02900000
                  DSN8410.DEPT ON DELETE RESTRICT,                      02910000
                RESPEMP  CHAR(6)        NOT NULL REFERENCES             02920000
                  DSN8410.EMP ON DELETE RESTRICT,                       02930000
                PRSTAFF  DECIMAL(5, 2)          ,                       02940000
                PRSTDATE DATE                   ,                       02950000
                PRENDATE DATE                   ,                       02960000
                MAJPROJ  CHAR(6))                                       02970000
        IN DSN8D41A.DSN8S41P;                                           02980000
                                                                        02990000
 ALTER  TABLESPACE DSN8D41A.DSN8S41P   CLOSE NO;                        03000000
                                                                        03010000
 ALTER  TABLESPACE DSN8D41A.DSN8S41E                                    03020000
        PART 3 COMPRESS NO;                                             03030000
                                                                        03040000
 CREATE UNIQUE INDEX DSN8410.XPROJ1                                     03050000
                  ON DSN8410.PROJ                                       03060000
                      (PROJNO   ASC)                                    03070000
                  USING STOGROUP DSN8G410                               03080000
                            PRIQTY 12                                   03090000
                            ERASE NO                                    03100000
                  BUFFERPOOL BP0                                        03110000
                  CLOSE NO                                              03120000
                  DSETPASS DSN8  ;                                      03130000
                                                                        03140000
 CREATE INDEX DSN8410.XPROJ2                                            03150000
                  ON DSN8410.PROJ                                       03160000
                      (RESPEMP  ASC)                                    03170000
                  USING STOGROUP DSN8G410                               03180000
                            PRIQTY 12                                   03190000
                            ERASE NO                                    03200000
                  BUFFERPOOL BP0                                        03210000
                  CLOSE NO                                              03220000
                  DSETPASS DSN8 ;                                       03230000
                                                                        03240000
 CREATE VIEW DSN8410.VPROJ                                              03250000
    AS SELECT ALL                                                       03260000
              PROJNO, PROJNAME, DEPTNO, RESPEMP, PRSTAFF,               03270000
              PRSTDATE, PRENDATE, MAJPROJ                               03280000
    FROM DSN8410.PROJ ;                                                 03290000
                                                                        03300000
 COMMIT ;                                                               03310000
                                                                        03320000
 CREATE TABLE DSN8410.ACT                                               03330000
               (ACTNO    SMALLINT       NOT NULL,                       03340000
                ACTKWD   CHAR(6)        NOT NULL,                       03350000
                ACTDESC  VARCHAR(20)    NOT NULL,                       03360000
                PRIMARY KEY(ACTNO))                                     03370000
        IN DSN8D41A.DSN8S41P;                                           03380000
                                                                        03390000
 ALTER  TABLESPACE DSN8D41A.DSN8S41P   CLOSE NO;                        03400000
                                                                        03410000
 CREATE UNIQUE INDEX DSN8410.XACT1                                      03420000
                  ON DSN8410.ACT                                        03430000
                      (ACTNO    ASC)                                    03440000
                  USING STOGROUP DSN8G410                               03450000
                            PRIQTY 12                                   03460000
                            ERASE NO                                    03470000
                  BUFFERPOOL BP0                                        03480000
                  CLOSE NO                                              03490000
                  DSETPASS DSN8  ;                                      03500000
                                                                        03510000
 CREATE UNIQUE INDEX DSN8410.XACT2                                      03520000
                  ON DSN8410.ACT                                        03530000
                      (ACTKWD   ASC)                                    03540000
                  USING STOGROUP DSN8G410                               03550000
                            PRIQTY 12                                   03560000
                            ERASE NO                                    03570000
                  BUFFERPOOL BP0                                        03580000
                  CLOSE NO                                              03590000
                  DSETPASS DSN8 ;                                       03600000
                                                                        03610000
 CREATE VIEW DSN8410.VACT                                               03620000
       AS SELECT ALL      ACTNO   ,                                     03630000
                       ACTKWD  ,                                        03640000
                       ACTDESC                                          03650000
            FROM DSN8410.ACT ;                                          03660000
                                                                        03670000
 COMMIT ;                                                               03680000
                                                                        03690000
 CREATE TABLE DSN8410.PROJACT                                           03700000
               (PROJNO   CHAR(6)        NOT NULL,                       03710000
                ACTNO    SMALLINT       NOT NULL,                       03720000
                ACSTAFF  DECIMAL(5, 2)          ,                       03730000
                ACSTDATE DATE           NOT NULL,                       03740000
                ACENDATE DATE                   ,                       03750000
                PRIMARY KEY(PROJNO,ACTNO,ACSTDATE),                     03760000
                FOREIGN KEY RPAP (PROJNO) REFERENCES DSN8410.PROJ       03770000
                  ON DELETE RESTRICT,                                   03780000
                FOREIGN KEY RPAA (ACTNO) REFERENCES DSN8410.ACT         03790000
                  ON DELETE RESTRICT)                                   03800000
        IN DSN8D41A.DSN8S41P;                                           03810000
                                                                        03820000
 ALTER  TABLESPACE DSN8D41A.DSN8S41P   CLOSE NO;                        03830000
                                                                        03840000
 CREATE UNIQUE INDEX DSN8410.XPROJAC1                                   03850000
                  ON DSN8410.PROJACT                                    03860000
                      (PROJNO   ASC,                                    03870000
                       ACTNO    ASC,                                    03880000
                       ACSTDATE ASC)                                    03890000
                  USING STOGROUP DSN8G410                               03900000
                            PRIQTY 12                                   03910000
                            ERASE NO                                    03920000
                  BUFFERPOOL BP0                                        03930000
                  CLOSE NO                                              03940000
                  DSETPASS DSN8  ;                                      03950000
                                                                        03960000
 CREATE VIEW DSN8410.VPROJACT                                           03970000
       AS SELECT ALL                                                    03980000
             PROJNO,ACTNO, ACSTAFF, ACSTDATE, ACENDATE                  03990000
             FROM DSN8410.PROJACT ;                                     04000000
                                                                        04010000
 COMMIT ;                                                               04020000
                                                                        04030000
 CREATE TABLE DSN8410.EMPPROJACT                                        04040000
               (EMPNO    CHAR(6)        NOT NULL,                       04050000
                PROJNO   CHAR(6)        NOT NULL,                       04060000
                ACTNO    SMALLINT       NOT NULL,                       04070000
                EMPTIME  DECIMAL(5, 2)          ,                       04080000
                EMSTDATE DATE                   ,                       04090000
                EMENDATE DATE                   ,                       04100000
                FOREIGN KEY REPAPA (PROJNO, ACTNO, EMSTDATE)            04110000
                  REFERENCES DSN8410.PROJACT                            04120000
                  ON DELETE RESTRICT,                                   04130000
                FOREIGN KEY REPAE (EMPNO) REFERENCES DSN8410.EMP        04140000
                  ON DELETE RESTRICT)                                   04150000
        IN DSN8D41A.DSN8S41P;                                           04160000
                                                                        04170000
 ALTER  TABLESPACE DSN8D41A.DSN8S41P   CLOSE NO;                        04180000
                                                                        04190000
 CREATE UNIQUE INDEX DSN8410.XEMPPROJACT1                               04200000
                  ON DSN8410.EMPPROJACT                                 04210000
                      (PROJNO   ASC,                                    04220000
                       ACTNO    ASC,                                    04230000
                       EMSTDATE ASC,                                    04240000
                       EMPNO    ASC)                                    04250000
                  USING STOGROUP DSN8G410                               04260000
                            PRIQTY 12                                   04270000
                            ERASE NO                                    04280000
                  BUFFERPOOL BP0                                        04290000
                  CLOSE NO                                              04300000
                  DSETPASS DSN8 ;                                       04310000
                                                                        04320000
 CREATE TYPE 2 INDEX DSN8410.XEMPPROJACT2                               04330000
                  ON DSN8410.EMPPROJACT                                 04340000
                      (EMPNO    ASC)                                    04350000
                  USING STOGROUP DSN8G410                               04360000
                            PRIQTY 12                                   04370000
                            ERASE NO                                    04380000
                  BUFFERPOOL BP0                                        04390000
                  CLOSE NO                                              04400000
                  DSETPASS DSN8 ;                                       04410000
                                                                        04420000
 CREATE VIEW DSN8410.VEMPPROJACT                                        04430000
       AS SELECT ALL                                                    04440000
           EMPNO, PROJNO, ACTNO, EMPTIME, EMSTDATE, EMENDATE            04450000
           FROM DSN8410.EMPPROJACT ;                                    04460000
                                                                        04470000
 COMMIT ;                                                               04480000
                                                                        04490000
 CREATE TABLE DSN8410.PARTS                                             04500000
               (ITEMNUM   CHAR(6)        NOT NULL,                      04510000
                DESCRIPT  VARCHAR(30)    NOT NULL,                      04520000
                COLOR     VARCHAR(8)             ,                      04530000
                SUPPLIER  VARCHAR(15)    NOT NULL)                      04540000
        IN DSN8D41A.DSN8S41S ;                                          04550000
                                                                        04560000
 CREATE TYPE 2 INDEX DSN8410.XPARTS                                     04570000
                  ON DSN8410.PARTS                                      04580000
                      (ITEMNUM  ASC)                                    04590000
                  USING STOGROUP DSN8G410                               04600000
                            PRIQTY 12                                   04610000
                            ERASE NO                                    04620000
                  BUFFERPOOL BP0                                        04630000
                  CLOSE NO                                              04640000
                  DSETPASS DSN8;                                        04650000
                                                                        04660000
 COMMIT ;                                                               04670000
                                                                        04680000
 CREATE TABLE DSN8410.TCONA                                             04690000
               (CONVID   CHAR(16)       NOT NULL,                       04700000
                LASTSCR  CHAR(8)        NOT NULL,                       04710000
                LASTPOS  CHAR(254)      NOT NULL,                       04720000
                LASTPOSC CHAR(254)      NOT NULL,                       04730000
                LASTMSG  LONG VARCHAR   NOT NULL)                       04740000
        IN DSN8D41P.DSN8S41C ;                                          04750000
                                                                        04760000
 CREATE UNIQUE INDEX DSN8410.XCONA1                                     04770000
                  ON DSN8410.TCONA                                      04780000
                      (CONVID   ASC)                                    04790000
                  USING STOGROUP DSN8G410                               04800000
                            PRIQTY 12                                   04810000
                            ERASE NO                                    04820000
                  BUFFERPOOL BP0                                        04830000
                  CLOSE NO                                              04840000
                  DSETPASS DSN8 ;                                       04850000
                                                                        04860000
 CREATE VIEW DSN8410.VCONA                                              04870000
    AS SELECT ALL                                                       04880000
                CONVID, LASTSCR, LASTPOS, LASTPOSC, LASTMSG             04890000
    FROM DSN8410.TCONA ;                                                04900000
                                                                        04910000
 COMMIT ;                                                               04920000
                                                                        04930000
 CREATE TABLE DSN8410.TOPTVAL                                           04940000
               (MAJSYS   CHAR(1)        NOT NULL,                       04950000
                ACTION   CHAR(1)        NOT NULL,                       04960000
                OBJECT   CHAR(2)        NOT NULL,                       04970000
                SRCHCRIT CHAR(2)        NOT NULL,                       04980000
                SCRTYPE  CHAR(1)        NOT NULL,                       04990000
                HEADTXT  CHAR(50)       NOT NULL,                       05000000
                SELTXT   CHAR(50)       NOT NULL,                       05010000
                INFOTXT  CHAR(79)       NOT NULL,                       05020000
                HELPTXT  CHAR(79)       NOT NULL,                       05030000
                PFKTXT   CHAR(79)       NOT NULL,                       05040000
                DSPINDEX CHAR(2)        NOT NULL)                       05050000
        IN DSN8D41P.DSN8S41C ;                                          05060000
                                                                        05070000
 CREATE TYPE 2 UNIQUE INDEX DSN8410.XOPTVAL1                            05080000
                  ON DSN8410.TOPTVAL                                    05090000
                      (MAJSYS   ASC,                                    05100000
                       ACTION   ASC,                                    05110000
                       OBJECT   ASC,                                    05120000
                       SRCHCRIT ASC,                                    05130000
                       SCRTYPE  ASC)                                    05140000
                  USING STOGROUP DSN8G410                               05150000
                            PRIQTY 12                                   05160000
                            ERASE NO                                    05170000
                  BUFFERPOOL BP0                                        05180000
                  CLOSE NO                                              05190000
                  DSETPASS DSN8;                                        05200000
                                                                        05210000
 CREATE VIEW DSN8410.VOPTVAL                                            05220000
    AS SELECT ALL                                                       05230000
         MAJSYS, ACTION, OBJECT, SRCHCRIT, SCRTYPE, HEADTXT,            05240000
         SELTXT, INFOTXT, HELPTXT, PFKTXT, DSPINDEX                     05250000
    FROM DSN8410.TOPTVAL ;                                              05260000
                                                                        05270000
 COMMIT ;                                                               05280000
                                                                        05290000
 CREATE TABLE DSN8410.TDSPTXT                                           05300000
               (DSPINDEX CHAR(2)        NOT NULL,                       05310000
                LINENO   CHAR(2)        NOT NULL,                       05320000
                DSPLINE  CHAR(79)       NOT NULL)                       05330000
        IN DSN8D41P.DSN8S41C ;                                          05340000
                                                                        05350000
 CREATE UNIQUE INDEX DSN8410.XDSPTXT1                                   05360000
                  ON DSN8410.TDSPTXT                                    05370000
                      (DSPINDEX ASC,                                    05380000
                       LINENO   ASC)                                    05390000
                  USING STOGROUP DSN8G410                               05400000
                            PRIQTY 12                                   05410000
                            ERASE NO                                    05420000
                  BUFFERPOOL BP0                                        05430000
                  CLOSE NO                                              05440000
                  DSETPASS DSN8 ;                                       05450000
                                                                        05460000
 CREATE VIEW DSN8410.VDSPTXT                                            05470000
    AS SELECT ALL                                                       05480000
                DSPINDEX, LINENO, DSPLINE                               05490000
    FROM DSN8410.TDSPTXT ;                                              05500000
                                                                        05510000
 ALTER TABLE DSN8410.DEPT                                               05520000
    FOREIGN KEY RDD (ADMRDEPT) REFERENCES DSN8410.DEPT                  05530000
      ON DELETE CASCADE;                                                05540000
 ALTER TABLE DSN8410.DEPT                                               05550000
    FOREIGN KEY RDE (MGRNO) REFERENCES DSN8410.EMP                      05560000
      ON DELETE SET NULL;                                               05570000
 ALTER TABLE DSN8410.PROJ                                               05580000
    FOREIGN KEY RPP (MAJPROJ) REFERENCES DSN8410.PROJ                   05590000
      ON DELETE CASCADE;                                                05600000
                                                                        05610000
 CREATE TABLE DSN8410.EDEPT    LIKE DSN8410.DEPT                        05620000
        IN DSN8D41A.DSN8S41R ;                                          05630000
 CREATE TABLE DSN8410.EEMP     LIKE DSN8410.EMP                         05640000
        IN DSN8D41A.DSN8S41R ;                                          05650000
 CREATE TABLE DSN8410.EPROJ    LIKE DSN8410.PROJ                        05660000
        IN DSN8D41A.DSN8S41R ;                                          05670000
 CREATE TABLE DSN8410.EACT     LIKE DSN8410.ACT                         05680000
        IN DSN8D41A.DSN8S41R ;                                          05690000
 CREATE TABLE DSN8410.EPROJACT LIKE DSN8410.PROJACT                     05700000
        IN DSN8D41A.DSN8S41R ;                                          05710000
 CREATE TABLE DSN8410.EEPA     LIKE DSN8410.EMPPROJACT                  05720000
        IN DSN8D41A.DSN8S41R ;                                          05730000
                                                                        05740000
 ALTER TABLE DSN8410.EDEPT                                              05750000
       ADD RID      CHAR(4);                                            05760000
 ALTER TABLE DSN8410.EDEPT                                              05770000
       ADD TSTAMP   TIMESTAMP;                                          05780000
 ALTER TABLE DSN8410.EEMP                                               05790000
       ADD RID      CHAR(4);                                            05800000
 ALTER TABLE DSN8410.EEMP                                               05810000
       ADD TSTAMP   TIMESTAMP;                                          05820000
 ALTER TABLE DSN8410.EPROJ                                              05830000
       ADD RID      CHAR(4);                                            05840000
 ALTER TABLE DSN8410.EPROJ                                              05850000
       ADD TSTAMP   TIMESTAMP;                                          05860000
 ALTER TABLE DSN8410.EACT                                               05870000
       ADD RID      CHAR(4);                                            05880000
 ALTER TABLE DSN8410.EACT                                               05890000
       ADD TSTAMP   TIMESTAMP;                                          05900000
 ALTER TABLE DSN8410.EPROJACT                                           05910000
       ADD RID      CHAR(4);                                            05920000
 ALTER TABLE DSN8410.EPROJACT                                           05930000
       ADD TSTAMP   TIMESTAMP;                                          05940000
 ALTER TABLE DSN8410.EEPA                                               05950000
       ADD RID      CHAR(4);                                            05960000
 ALTER TABLE DSN8410.EEPA                                               05970000
       ADD TSTAMP   TIMESTAMP;                                          05980000
                                                                        05990000
//*                                                                     06000000
//*        STEP  3: CREATE SAMPLE VIEWS                                 06010000
//PH01S03 EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)                     06020000
//SYSTSPRT DD  SYSOUT=*                                                 06030000
//SYSTSIN  DD  *                                                        06040000
 DSN SYSTEM(DB1G)                                                       06050000
 RUN  PROGRAM(DSNTIAD) PLAN(DSNTIA41) -                                 06060000
      LIB('DSN410.RUNLIB.LOAD')                                         06070000
//SYSPRINT DD  SYSOUT=*                                                 06080000
//SYSUDUMP DD  SYSOUT=*                                                 06090000
//SYSIN    DD  *                                                        06100000
                                                                        06110000
 CREATE VIEW DSN8410.VDEPMG1                                            06120000
       (DEPTNO, DEPTNAME, MGRNO, FIRSTNME, MIDINIT, LASTNAME, ADMRDEPT) 06130000
     AS SELECT ALL                                                      06140000
        DEPTNO, DEPTNAME, EMPNO, FIRSTNME, MIDINIT, LASTNAME, ADMRDEPT  06150000
         FROM DSN8410.DEPT LEFT OUTER JOIN DSN8410.EMP                  06160000
         ON MGRNO = EMPNO ;                                             06170000
                                                                        06180000
 CREATE VIEW DSN8410.VEMPDPT1                                           06190000
       (DEPTNO, DEPTNAME, EMPNO, FRSTINIT, MIDINIT,                     06200000
        LASTNAME, WORKDEPT)                                             06210000
     AS SELECT ALL                                                      06220000
        DEPTNO, DEPTNAME, EMPNO, SUBSTR(FIRSTNME,1,1), MIDINIT,         06230000
        LASTNAME, WORKDEPT                                              06240000
         FROM DSN8410.DEPT RIGHT OUTER JOIN DSN8410.EMP                 06250000
         ON WORKDEPT = DEPTNO ;                                         06260000
                                                                        06270000
 CREATE VIEW DSN8410.VASTRDE1                                           06280000
     (DEPT1NO,DEPT1NAM,EMP1NO,EMP1FN,EMP1MI,EMP1LN,TYPE2,               06290000
      DEPT2NO,DEPT2NAM,EMP2NO,EMP2FN,EMP2MI,EMP2LN)                     06300000
     AS SELECT ALL                                                      06310000
         D1.DEPTNO,D1.DEPTNAME,D1.MGRNO,D1.FIRSTNME,D1.MIDINIT,         06320000
         D1.LASTNAME, '1',                                              06330000
         D2.DEPTNO,D2.DEPTNAME,D2.MGRNO,D2.FIRSTNME,D2.MIDINIT,         06340000
         D2.LASTNAME                                                    06350000
         FROM DSN8410.VDEPMG1 D1, DSN8410.VDEPMG1 D2                    06360000
         WHERE D1.DEPTNO = D2.ADMRDEPT ;                                06370000
                                                                        06380000
 CREATE VIEW DSN8410.VASTRDE2                                           06390000
     (DEPT1NO,DEPT1NAM,EMP1NO,EMP1FN,EMP1MI,EMP1LN,TYPE2,               06400000
      DEPT2NO,DEPT2NAM,EMP2NO,EMP2FN,EMP2MI,EMP2LN)                     06410000
     AS SELECT ALL                                                      06420000
          D1.DEPTNO,D1.DEPTNAME,D1.MGRNO,D1.FIRSTNME,D1.MIDINIT,        06430000
          D1.LASTNAME,'2',                                              06440000
          D1.DEPTNO,D1.DEPTNAME,E2.EMPNO,E2.FIRSTNME,E2.MIDINIT,        06450000
          E2.LASTNAME                                                   06460000
          FROM DSN8410.VDEPMG1 D1, DSN8410.EMP E2                       06470000
          WHERE D1.DEPTNO = E2.WORKDEPT;                                06480000
                                                                        06490000
 CREATE VIEW DSN8410.VPROJRE1                                           06500000
   (PROJNO,PROJNAME,PROJDEP,RESPEMP,FIRSTNME,MIDINIT,LASTNAME,MAJPROJ)  06510000
    AS SELECT ALL                                                       06520000
       PROJNO,PROJNAME,DEPTNO,EMPNO,FIRSTNME,MIDINIT,LASTNAME,MAJPROJ   06530000
      FROM DSN8410.PROJ, DSN8410.EMP                                    06540000
      WHERE RESPEMP = EMPNO ;                                           06550000
                                                                        06560000
 CREATE VIEW DSN8410.VPSTRDE1                                           06570000
   (PROJ1NO,PROJ1NAME,RESP1NO,RESP1FN,RESP1MI,RESP1LN,                  06580000
    PROJ2NO,PROJ2NAME,RESP2NO,RESP2FN,RESP2MI,RESP2LN)                  06590000
    AS SELECT ALL                                                       06600000
         P1.PROJNO,P1.PROJNAME,P1.RESPEMP,P1.FIRSTNME,P1.MIDINIT,       06610000
         P1.LASTNAME,                                                   06620000
         P2.PROJNO,P2.PROJNAME,P2.RESPEMP,P2.FIRSTNME,P2.MIDINIT,       06630000
         P2.LASTNAME                                                    06640000
      FROM DSN8410.VPROJRE1 P1,                                         06650000
        DSN8410.VPROJRE1 P2                                             06660000
      WHERE P1.PROJNO = P2.MAJPROJ ;                                    06670000
                                                                        06680000
 CREATE VIEW DSN8410.VPSTRDE2                                           06690000
   (PROJ1NO,PROJ1NAME,RESP1NO,RESP1FN,RESP1MI,RESP1LN,                  06700000
    PROJ2NO,PROJ2NAME,RESP2NO,RESP2FN,RESP2MI,RESP2LN)                  06710000
    AS SELECT ALL                                                       06720000
         P1.PROJNO,P1.PROJNAME,P1.RESPEMP,P1.FIRSTNME,P1.MIDINIT,       06730000
         P1.LASTNAME,                                                   06740000
         P1.PROJNO,P1.PROJNAME,P1.RESPEMP,P1.FIRSTNME,P1.MIDINIT,       06750000
         P1.LASTNAME                                                    06760000
      FROM DSN8410.VPROJRE1 P1                                          06770000
        WHERE NOT EXISTS                                                06780000
          (SELECT * FROM DSN8410.VPROJRE1 P2                            06790000
            WHERE P1.PROJNO = P2.MAJPROJ) ;                             06800000
                                                                        06810000
 CREATE VIEW DSN8410.VFORPLA                                            06820000
   (PROJNO,PROJNAME,RESPEMP,PROJDEP,FRSTINIT,MIDINIT,LASTNAME)          06830000
    AS SELECT ALL                                                       06840000
       F1.PROJNO,PROJNAME,RESPEMP,PROJDEP, SUBSTR(FIRSTNME,1,1),        06850000
       MIDINIT, LASTNAME                                                06860000
      FROM DSN8410.VPROJRE1 F1 LEFT OUTER JOIN DSN8410.EMPPROJACT F2    06870000
      ON F1.PROJNO = F2.PROJNO;                                         06880000
                                                                        06890000
 CREATE VIEW DSN8410.VSTAFAC1                                           06900000
   (PROJNO, ACTNO, ACTDESC, EMPNO, FIRSTNME, MIDINIT, LASTNAME,         06910000
    EMPTIME,STDATE,ENDATE, TYPE)                                        06920000
    AS SELECT ALL                                                       06930000
          PA.PROJNO, PA.ACTNO, AC.ACTDESC,' ', ' ', ' ', ' ',           06940000
          PA.ACSTAFF, PA.ACSTDATE,                                      06950000
          PA.ACENDATE,'1'                                               06960000
      FROM DSN8410.PROJACT PA, DSN8410.ACT AC                           06970000
      WHERE PA.ACTNO = AC.ACTNO ;                                       06980000
                                                                        06990000
 CREATE VIEW DSN8410.VSTAFAC2                                           07000000
   (PROJNO, ACTNO, ACTDESC, EMPNO, FIRSTNME, MIDINIT, LASTNAME,         07010000
    EMPTIME,STDATE, ENDATE, TYPE)                                       07020000
    AS SELECT ALL                                                       07030000
          EP.PROJNO, EP.ACTNO, AC.ACTDESC, EP.EMPNO,EM.FIRSTNME,        07040000
          EM.MIDINIT, EM.LASTNAME, EP.EMPTIME, EP.EMSTDATE,             07050000
          EP.EMENDATE,'2'                                               07060000
      FROM DSN8410.EMPPROJACT EP, DSN8410.ACT AC, DSN8410.EMP EM        07070000
      WHERE EP.ACTNO = AC.ACTNO  AND EP.EMPNO = EM.EMPNO ;              07080000
                                                                        07090000
 CREATE VIEW DSN8410.VPHONE                                             07100000
               (LASTNAME,                                               07110000
                FIRSTNAME,                                              07120000
                MIDDLEINITIAL,                                          07130000
                PHONENUMBER,                                            07140000
                EMPLOYEENUMBER,                                         07150000
                DEPTNUMBER,                                             07160000
                DEPTNAME)                                               07170000
    AS SELECT ALL      LASTNAME,                                        07180000
                       FIRSTNME,                                        07190000
                       MIDINIT ,                                        07200000
                       VALUE(PHONENO,'    '),                           07210000
                       EMPNO,                                           07220000
                       DEPTNO,                                          07230000
                       DEPTNAME                                         07240000
    FROM DSN8410.EMP, DSN8410.DEPT                                      07250000
    WHERE WORKDEPT = DEPTNO;                                            07260000
                                                                        07270000
 CREATE VIEW DSN8410.VEMPLP                                             07280000
               (EMPLOYEENUMBER,                                         07290000
                PHONENUMBER)                                            07300000
    AS SELECT ALL      EMPNO   ,                                        07310000
                       PHONENO                                          07320000
    FROM DSN8410.EMP ;                                                  07330000
//*                                                                     07340000
//*                                                                     07350000
//*        STEP  4: DROP SYNONYMS                                       07360000
//PH01S04 EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)                     07370000
//SYSTSPRT DD  SYSOUT=*                                                 07380000
//SYSTSIN  DD  *                                                        07390000
 DSN SYSTEM(DB1G)                                                       07400000
 RUN  PROGRAM(DSNTIAD) PLAN(DSNTIA41) PARM('RC0') -                     07410000
      LIB('DSN410.RUNLIB.LOAD')                                         07420000
//SYSPRINT DD  SYSOUT=*                                                 07430000
//SYSUDUMP DD  SYSOUT=*                                                 07440000
//SYSIN    DD  *                                                        07450000
  DROP   SYNONYM ACT   ;                                                07460000
  DROP   SYNONYM TCONA     ;                                            07470000
  DROP   SYNONYM DEPT      ;                                            07480000
  DROP   SYNONYM TDSPTXT   ;                                            07490000
  DROP   SYNONYM EMP       ;                                            07500000
  DROP   SYNONYM EMPPROJACT;                                            07510000
  DROP   SYNONYM TOPTVAL   ;                                            07520000
  DROP   SYNONYM PROJACT   ;                                            07530000
  DROP   SYNONYM PROJ      ;                                            07540000
  DROP   SYNONYM VPHONE    ;                                            07550000
  DROP   SYNONYM VACT      ;                                            07560000
  DROP   SYNONYM VCONA     ;                                            07570000
  DROP   SYNONYM VDEPT     ;                                            07580000
  DROP   SYNONYM VHDEPT    ;                                            07590000
  DROP   SYNONYM VDSPTXT   ;                                            07600000
  DROP   SYNONYM VEMP      ;                                            07610000
  DROP   SYNONYM VEMPPROJACT;                                           07620000
  DROP   SYNONYM VOPTVAL   ;                                            07630000
  DROP   SYNONYM VPROJACT  ;                                            07640000
  DROP   SYNONYM VPROJ     ;                                            07650000
  DROP   SYNONYM VEMPLP    ;                                            07660000
  DROP   SYNONYM VDEPMG1   ;                                            07670000
  DROP   SYNONYM VEMPDPT1  ;                                            07680000
  DROP   SYNONYM VASTRDE1  ;                                            07690000
  DROP   SYNONYM VASTRDE2  ;                                            07700000
  DROP   SYNONYM VPROJRE1  ;                                            07710000
  DROP   SYNONYM VPSTRDE1  ;                                            07720000
  DROP   SYNONYM VPSTRDE2  ;                                            07730000
  DROP   SYNONYM VFORPLA   ;                                            07740000
  DROP   SYNONYM VSTAFAC1  ;                                            07750000
  DROP   SYNONYM VSTAFAC2  ;                                            07760000
//*                                                                     07770000
//*          STEP 5:  CREATE SYNONYMS                                   07770001
//PH01S05 EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)                     07790000
//SYSTSPRT DD  SYSOUT=*                                                 07800000
//SYSTSIN  DD  *                                                        07810000
 DSN SYSTEM(DB1G)                                                       07820000
 RUN  PROGRAM(DSNTIAD) PLAN(DSNTIA41) -                                 07830000
      LIB('DSN410.RUNLIB.LOAD')                                         07840000
//SYSPRINT DD  SYSOUT=*                                                 07850000
//SYSUDUMP DD  SYSOUT=*                                                 07860000
//SYSIN    DD  *                                                        07870000
  CREATE SYNONYM ACT         FOR DSN8410.ACT ;                          07880000
  CREATE SYNONYM TCONA       FOR DSN8410.TCONA ;                        07890000
  CREATE SYNONYM DEPT        FOR DSN8410.DEPT ;                         07900000
  CREATE SYNONYM TDSPTXT     FOR DSN8410.TDSPTXT ;                      07910000
  CREATE SYNONYM EMP         FOR DSN8410.EMP ;                          07920000
  CREATE SYNONYM EMPPROJACT  FOR DSN8410.EMPPROJACT ;                   07930000
  CREATE SYNONYM TOPTVAL     FOR DSN8410.TOPTVAL ;                      07940000
  CREATE SYNONYM PROJACT     FOR DSN8410.PROJACT ;                      07950000
  CREATE SYNONYM PROJ        FOR DSN8410.PROJ ;                         07960000
  CREATE SYNONYM VPHONE      FOR DSN8410.VPHONE ;                       07970000
  CREATE SYNONYM VACT        FOR DSN8410.VACT ;                         07980000
  CREATE SYNONYM VCONA       FOR DSN8410.VCONA ;                        07990000
  CREATE SYNONYM VDEPT       FOR DSN8410.VDEPT ;                        08000000
  CREATE SYNONYM VHDEPT      FOR DSN8410.VHDEPT ;                       08010000
  CREATE SYNONYM VDSPTXT     FOR DSN8410.VDSPTXT ;                      08020000
  CREATE SYNONYM VEMP        FOR DSN8410.VEMP ;                         08030000
  CREATE SYNONYM VEMPPROJACT FOR DSN8410.VEMPPROJACT ;                  08040000
  CREATE SYNONYM VOPTVAL     FOR DSN8410.VOPTVAL ;                      08050000
  CREATE SYNONYM VPROJACT    FOR DSN8410.VPROJACT ;                     08060000
  CREATE SYNONYM VPROJ       FOR DSN8410.VPROJ ;                        08070000
  CREATE SYNONYM VEMPLP      FOR DSN8410.VEMPLP ;                       08080000
  CREATE SYNONYM VDEPMG1     FOR DSN8410.VDEPMG1 ;                      08090000
  CREATE SYNONYM VEMPDPT1    FOR DSN8410.VEMPDPT1 ;                     08100000
  CREATE SYNONYM VASTRDE1    FOR DSN8410.VASTRDE1;                      08110000
  CREATE SYNONYM VASTRDE2    FOR DSN8410.VASTRDE2;                      08120000
  CREATE SYNONYM VPROJRE1    FOR DSN8410.VPROJRE1;                      08130000
  CREATE SYNONYM VPSTRDE1    FOR DSN8410.VPSTRDE1;                      08140000
  CREATE SYNONYM VPSTRDE2    FOR DSN8410.VPSTRDE2;                      08150000
  CREATE SYNONYM VFORPLA     FOR DSN8410.VFORPLA;                       08160000
  CREATE SYNONYM VSTAFAC1    FOR DSN8410.VSTAFAC1;                      08170000
  CREATE SYNONYM VSTAFAC2    FOR DSN8410.VSTAFAC2;                      08180000
        TO PUBLIC AT ALL LOCATIONS;                                     08880000
  GRANT DELETE, INSERT, SELECT, UPDATE ON TABLE DSN8410.VSTAFAC2        08890000
        TO PUBLIC AT ALL LOCATIONS;                                     08900000
//*                                                                     08910000
//*                                                                     08920000
//*                                                                     08930000
//*        STEP  6: ASSEMBLE AND LINKEDIT EDIT EXIT                     08940000
//PH01S06 EXEC ASMCL,MEM=DSN8EAE1,COND=(4,LT),                          08950000
//         PARM.LKED='LIST,XREF,NCAL,RENT'                              08960000
//*                                                                     08970000
//*        STEP  7: ASSEMBLE AND LINKEDIT EDIT EXIT                     08980000
//PH01S07 EXEC ASMCL,MEM=DSN8HUFF,COND=(4,LT),                          08990000
//         PARM.LKED='LIST,XREF,NCAL,RENT'                              09000000
//*                                                                     09010000
//*        STEP  8: ASSEMBLE AND LINKEDIT FIELD PROCEDURE               09020000
//PH01S08 EXEC ASMCL,MEM=DSN8FPRC,COND=(4,LT),                          09030000
//         PARM.ASM='RENT,OBJECT,NODECK,SYSPARM(FLDPROC)',              09040000
//         PARM.LKED='LIST,XREF,NCAL,RENT'                              09050000
//*                                                                     09060000
//*        STEP  9: PRECOMPILE, ASSEMBLE AND LINKEDIT THE               09070000
//*                 CALL ATTACH ASSEMBLER INTERFACE                     09080000
//*                                                                     09090000
//PH01S09 EXEC DSNHASM,MEM=DSN8CA,                                      09100000
//         COND=(4,LT),                                                 09110000
//         PARM.PC='HOST(ASM),STDSQL(NO)',                              09120000
//         PARM.ASM='RENT,OBJECT,NODECK',                               09130000
//         PARM.LKED='RENT,XREF'                                        09140000
//PC.DBRMLIB   DD DSN=DSN410.DBRMLIB.DATA(DSN8CA),                      09150000
//             DISP=SHR                                                 09160000
//PC.SYSLIB    DD DSN=DSN410.SDSNSAMP,                                  09170000
//             DISP=SHR                                                 09180000
//PC.SYSIN     DD DSN=DSN410.SDSNSAMP(DSN8CA),                          09190000
//             DISP=SHR                                                 09200000
//ASM.SYSLIB   DD                                                       09210000
//             DD DSN=DSN410.SDSNSAMP,                                  09220000
//             DISP=SHR                                                 09230000
//LKED.SYSLMOD DD DSN=DSN410.RUNLIB.LOAD(DSN8CA),                       09240000
//             DISP=SHR                                                 09250000
//LKED.SYSIN   DD *                                                     09260000
  INCLUDE SYSLIB(DSNALI)                                                09270000
//*                                                                     09280000
//*        STEP 10: LOAD DATA INTO SAMPLE PROGRAM TABLES                09290000
//PH01S10 EXEC DSNUPROC,PARM='DB1G,DSNTEX',COND=(4,LT)                  09300000
//SORTLIB  DD  DSN=SYS1.SORTLIB,DISP=SHR                                09310000
//SORTOUT  DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   09320000
//SORTWK01 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   09330000
//SORTWK02 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   09340000
//SORTWK03 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   09350000
//SORTWK04 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   09360000
//DSNTRACE DD  SYSOUT=*                                                 09370000
//SYSRECDT DD  DSN=DSN410.SDSNSAMP(DSN8LDT),                            09380000
//             DISP=SHR                                                 09390000
//SYSRECOV DD  DSN=DSN410.SDSNSAMP(DSN8LOV),                            09400000
//             DISP=SHR                                                 09410000
//SYSUT1   DD  UNIT=3390,SPACE=(4000,(50,50),,,ROUND)                   09420000
//SYSIN    DD  *                                                        09430000
                                                                        09440000
 LOAD DATA INDDN(SYSRECOV) CONTINUEIF(72:72)='X'                        09450000
      INTO TABLE DSN8410.TOPTVAL                                        09460000
           (MAJSYS   POSITION(  2) CHAR(1),                             09470000
            ACTION   POSITION(  4) CHAR(1),                             09480000
            OBJECT   POSITION(  6) CHAR(2),                             09490000
            SRCHCRIT POSITION(  9) CHAR(2),                             09500000
            SCRTYPE  POSITION( 12) CHAR(1),                             09510000
            HEADTXT  POSITION( 80) CHAR(50),                            09520000
            SELTXT   POSITION(159) CHAR(50),                            09530000
            INFOTXT  POSITION(238) CHAR(71),                            09540000
            HELPTXT  POSITION(317) CHAR(71),                            09550000
            PFKTXT   POSITION(396) CHAR(71),                            09560000
            DSPINDEX POSITION(475) CHAR(2))                             09570000
                                                                        09580000
 LOAD DATA INDDN(SYSRECDT) CONTINUEIF(72:72)='X' RESUME(YES)            09590000
      INTO TABLE DSN8410.TDSPTXT                                        09600000
           (DSPINDEX POSITION( 2) CHAR(2),                              09610000
            LINENO   POSITION( 6) CHAR(2),                              09620000
            DSPLINE  POSITION(80) CHAR(71))                             09630000
                                                                        09640000
//*        STEP 11: LOAD DATA INTO SAMPLE APPLICATION TABLES            09650000
//PH01S11 EXEC DSNUPROC,PARM='DB1G,DSNTEX',COND=(4,LT)                  09660000
//SYSUT1   DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   09670000
//SORTLIB  DD  DSN=SYS1.SORTLIB,DISP=SHR                                09680000
//SORTOUT  DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   09690000
//SORTWK01 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   09700000
//SORTWK02 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   09710000
//SORTWK03 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   09720000
//SORTWK04 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   09730000
//DSNTRACE DD  SYSOUT=*                                                 09740000
//SYSRECAC DD  DSN=DSN410.SDSNSAMP(DSN8LAC),                            09750000
//             DISP=SHR                                                 09760000
//SYSRECDP DD  DSN=DSN410.SDSNSAMP(DSN8LDP),                            09770000
//             DISP=SHR                                                 09780000
//SYSRECEM DD  DSN=DSN410.SDSNSAMP(DSN8LEM),                            09790000
//             DISP=SHR                                                 09800000
//SYSRECEP DD  DSN=DSN410.SDSNSAMP(DSN8LEP),                            09810000
//             DISP=SHR                                                 09820000
//SYSRECPA DD  DSN=DSN410.SDSNSAMP(DSN8LPA),                            09830000
//             DISP=SHR                                                 09840000
//SYSRECPJ DD DSN=DSN410.SDSNSAMP(DSN8LPJ),                             09850000
//             DISP=SHR                                                 09860000
//SYSERR   DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   09870000
//SYSDISC  DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   09880000
//SYSMAP   DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   09890000
//SYSIN    DD  *                                                        09900000
                                                                        09910000
 LOAD DATA INDDN(SYSRECDP)                                              09920000
      INTO TABLE DSN8410.DEPT                                           09930000
           (DEPTNO   POSITION( 1) CHAR(3),                              09940000
            DEPTNAME POSITION( 5) VARCHAR,                              09950000
            MGRNO    POSITION(37) CHAR(6) NULLIF(MGRNO='      '),       09960000
            ADMRDEPT POSITION(44) CHAR(3),                              09970000
            LOCATION POSITION(48) CHAR(16))                             09980000
      ENFORCE NO                                                        09990000
                                                                        10000000
 LOAD DATA INDDN(SYSRECEM) CONTINUEIF(72:72)='X'                        10010000
      INTO TABLE DSN8410.EMP                                            10020000
           (EMPNO     POSITION( 1)  CHAR(6),                            10030000
            FIRSTNME  POSITION( 8)  VARCHAR,                            10040000
            MIDINIT   POSITION(21)  CHAR(1),                            10050000
            LASTNAME  POSITION(23)  VARCHAR,                            10060000
            WORKDEPT  POSITION(36)  CHAR(3),                            10070000
            PHONENO   POSITION(40)  CHAR(4),                            10080000
            HIREDATE  POSITION(45)  DATE EXTERNAL,                      10090000
            JOB       POSITION(56)  CHAR(8),                            10100000
            EDLEVEL   POSITION(65)  INTEGER EXTERNAL(2),                10110000
            SEX       POSITION(68)  CHAR(1),                            10120000
            BIRTHDATE POSITION(80)  DATE EXTERNAL,                      10130000
            SALARY    POSITION(91)  INTEGER EXTERNAL(5),                10140000
            BONUS     POSITION(97)  INTEGER EXTERNAL(5),                10150000
            COMM      POSITION(103) INTEGER EXTERNAL(5))                10160000
      ENFORCE CONSTRAINTS MAPDDN SYSMAP                                 10170000
                                                                        10180000
 LOAD DATA INDDN(SYSRECPJ) RESUME YES CONTINUEIF(72:72)='X'             10190000
      INTO TABLE DSN8410.PROJ                                           10200000
           (PROJNO   POSITION( 1) CHAR(6),                              10210000
            PROJNAME POSITION( 8) VARCHAR,                              10220000
            DEPTNO   POSITION(33) CHAR(3),                              10230000
            RESPEMP  POSITION(37) CHAR(6),                              10240000
            PRSTAFF  POSITION(44) DECIMAL EXTERNAL(5),                  10250000
            PRSTDATE POSITION(50) DATE EXTERNAL,                        10260000
            PRENDATE POSITION(61) DATE EXTERNAL,                        10270000
            MAJPROJ  POSITION(80) CHAR(6) NULLIF(MAJPROJ='      '))     10280000
      ENFORCE NO                                                        10290000
                                                                        10300000
 LOAD DATA INDDN(SYSRECAC) RESUME YES                                   10310000
      INTO TABLE DSN8410.ACT                                            10320000
           (ACTNO    POSITION( 1) INTEGER EXTERNAL(3),                  10330000
            ACTKWD   POSITION( 5) CHAR(6),                              10340000
            ACTDESC  POSITION(13) VARCHAR)                              10350000
      ENFORCE NO                                                        10360000
                                                                        10370000
 LOAD DATA INDDN(SYSRECPA) RESUME YES                                   10380000
      INTO TABLE DSN8410.PROJACT                                        10390000
           (PROJNO   POSITION( 1) CHAR(6),                              10400000
            ACTNO    POSITION( 8) INTEGER EXTERNAL(3),                  10410000
            ACSTAFF  POSITION(12) DECIMAL EXTERNAL(5),                  10420000
            ACSTDATE POSITION(18) DATE EXTERNAL,                        10430000
            ACENDATE POSITION(29) DATE EXTERNAL)                        10440000
      ENFORCE NO                                                        10450000
                                                                        10460000
 LOAD DATA INDDN(SYSRECEP) RESUME YES                                   10470000
      INTO TABLE DSN8410.EMPPROJACT                                     10480000
           (EMPNO    POSITION( 1) CHAR(6),                              10490000
            PROJNO   POSITION( 8) CHAR(6),                              10500000
            ACTNO    POSITION(16) INTEGER EXTERNAL(3),                  10510000
            EMPTIME  POSITION(20) DECIMAL EXTERNAL(5),                  10520000
            EMSTDATE POSITION(26) DATE EXTERNAL,                        10530000
            EMENDATE POSITION(37) DATE EXTERNAL)                        10540000
      ENFORCE NO                                                        10550000
                                                                        10560000
//*        STEP 12: CHECK DATA FOR REFERENTIAL INTEGRITY                10570000
//PH01S12 EXEC DSNUPROC,PARM='DB1G,DSNTEX',COND=(4,LT)                  10580000
//SYSUT1   DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   10590000
//SORTLIB  DD  DSN=SYS1.SORTLIB,DISP=SHR                                10600000
//SORTOUT  DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   10610000
//SORTWK01 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   10620000
//SORTWK02 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   10630000
//SORTWK03 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   10640000
//SORTWK04 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   10650000
//DSNTRACE DD  SYSOUT=*                                                 10660000
//SYSERR   DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   10670000
//SYSIN    DD  *                                                        10680000
                                                                        10690000
 CHECK DATA TABLESPACE DSN8D41A.DSN8S41D                                10700000
            TABLESPACE DSN8D41A.DSN8S41E                                10710000
            TABLESPACE DSN8D41A.DSN8S41P                                10720000
       SCOPE ALL                                                        10730000
       DELETE YES                                                       10740000
       FOR EXCEPTION IN DSN8410.DEPT       USE DSN8410.EDEPT            10750000
                     IN DSN8410.EMP        USE DSN8410.EEMP             10760000
                     IN DSN8410.PROJ       USE DSN8410.EPROJ            10770000
                     IN DSN8410.ACT        USE DSN8410.EACT             10780000
                     IN DSN8410.PROJACT    USE DSN8410.EPROJACT         10790000
                     IN DSN8410.EMPPROJACT USE DSN8410.EEPA             10800000
       EXCEPTIONS 50                                                    10810000
       SORTDEVT SYSDA                                                   10820000
                                                                        10830000
//*        STEP 13: ESTABLISH A QUIESCE POINT                           10840000
//PH01S13 EXEC DSNUPROC,PARM='DB1G,DSNTEX',COND=(4,LT)                  10850000
//* NOTE: CONDITION CODE 4 INDICATES AN IMAGE COPY CANNOT BE TAKEN      10860000
//SYSUT1   DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   10870000
//SYSIN    DD  *                                                        10880000
                                                                        10890000
 QUIESCE TABLESPACE DSN8D41A.DSN8S41D                                   10900000
         TABLESPACE DSN8D41A.DSN8S41E                                   10910000
         TABLESPACE DSN8D41A.DSN8S41P                                   10920000
                                                                        10930000
//*        STEP 14: TAKE IMAGE COPY OF SAMPLE TABLES                    10940000
//PH01S14 EXEC DSNUPROC,PARM='DB1G,DSNTEX',COND=(4,LT)                  10950000
//DSNTRACE DD  SYSOUT=*                                                 10960000
//SYSCOPY  DD  DSN=DSN410.SYSCOPY.DSN8D41A.DSN8S41D,                    10970000
//             UNIT=3390,DISP=(NEW,CATLG),SPACE=(4000,(20,20)),         10980000
//             VOL=SER=DB22SY                                           10990000
//SYSCOPY2 DD  DSN=DSN410.SYSCOPY.DSN8D41A.DSN8S41E,                    11000000
//             UNIT=3390,DISP=(NEW,CATLG),SPACE=(4000,(20,20)),         11010000
//             VOL=SER=DB22SY                                           11020000
//SYSCOPY3 DD  DSN=DSN410.SYSCOPY.DSN8D41P.DSN8S41C,                    11030000
//             UNIT=3390,DISP=(NEW,CATLG),SPACE=(4000,(20,20)),         11040000
//             VOL=SER=DB22SY                                           11050000
//SYSCOPY4 DD  DSN=DSN410.SYSCOPY.DSN8D41A.DSN8S41P,                    11060000
//             UNIT=3390,DISP=(NEW,CATLG),SPACE=(4000,(20,20)),         11070000
//             VOL=SER=DB22SY                                           11080000
//SYSIN    DD  *                                                        11090000
                                                                        11100000
 COPY TABLESPACE DSN8D41A.DSN8S41D                                      11110000
                                                                        11120000
 COPY TABLESPACE DSN8D41A.DSN8S41E COPYDDN SYSCOPY2                     11130000
                                                                        11140000
 COPY TABLESPACE DSN8D41P.DSN8S41C COPYDDN SYSCOPY3                     11150000
                                                                        11160000
 COPY TABLESPACE DSN8D41A.DSN8S41P COPYDDN SYSCOPY4                     11170000
                                                                        11180000
//*        STEP 15: ESTABLISH A QUIESCE POINT USING ONLY IMAGE COPIES   11190000
//PH01S15 EXEC DSNUPROC,PARM='DB1G,DSNTEX',COND=(4,LT)                  11200000
//SYSUT1   DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   11210000
//SYSIN    DD  *                                                        11220000
                                                                        11230000
 QUIESCE TABLESPACE DSN8D41A.DSN8S41D                                   11240000
         TABLESPACE DSN8D41A.DSN8S41E                                   11250000
         TABLESPACE DSN8D41A.DSN8S41P                                   11260000
                                                                        11270000
//*                                                                     11280000
//*        STEP 16: REORGANIZE TABLESPACES, PRODUCE STATISTICS          11290000
//PH01S16 EXEC DSNUPROC,PARM='DB1G,DSNTEX',COND=(4,LT)                  11300000
//SORTLIB  DD  DSN=SYS1.SORTLIB,DISP=SHR                                11310000
//SORTOUT  DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   11320000
//SORTWK01 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   11330000
//SORTWK02 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   11340000
//SORTWK03 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   11350000
//SORTWK04 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   11360000
//DSNTRACE DD  SYSOUT=*                                                 11370000
//SYSUT1   DD  UNIT=3390,SPACE=(4000,(50,50),,,ROUND)                   11380000
//SYSREC   DD  UNIT=3390,SPACE=(4000,(200,200),,,ROUND)                 11390000
//SYSIN    DD  *                                                        11400000
                                                                        11410000
 REORG TABLESPACE DSN8D41A.DSN8S41D SORTDEVT(SYSDA)                     11420000
                                                                        11430000
 RUNSTATS TABLESPACE DSN8D41A.DSN8S41D                                  11440000
         INDEX(ALL)                                                     11450000
                                                                        11460000
 RUNSTATS TABLESPACE DSN8D41A.DSN8S41E                                  11470000
         INDEX(ALL)                                                     11480000
                                                                        11490000
 RUNSTATS TABLESPACE DSN8D41A.DSN8S41P                                  11500000
         INDEX(ALL)                                                     11510000
                                                                        11520000
                                                                        11530000
 RUNSTATS TABLESPACE DSN8D41P.DSN8S41C                                  11540000
         INDEX(ALL)                                                     11550000
                                                                        11560000
//*        STEP 17: LOAD DATA INTO PART 3 OF DSN8D41A.DSN8S41E          11570000
//PH01S17 EXEC DSNUPROC,PARM='DB1G,DSNTEX',COND=(4,LT)                  11580000
//SYSUT1   DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   11590000
//SORTLIB  DD  DSN=SYS1.SORTLIB,DISP=SHR                                11600000
//SORTOUT  DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   11610000
//SORTWK01 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   11620000
//SORTWK02 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   11630000
//SORTWK03 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   11640000
//SORTWK04 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   11650000
//DSNTRACE DD  SYSOUT=*                                                 11660000
//SYSRECE3 DD  DSN=DSN410.SDSNSAMP(DSN8LE3),                            11670000
//             DISP=SHR                                                 11680000
//SYSERR   DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   11690000
//SYSDISC  DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   11700000
//SYSMAP   DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   11710000
//SYSIN    DD  *                                                        11720000
                                                                        11730000
 LOAD DATA INDDN(SYSRECE3) CONTINUEIF(72:72)='X'                        11740000
      RESUME YES                                                        11750000
      INTO TABLE DSN8410.EMP                                            11760000
           PART 3                                                       11770000
           REPLACE                                                      11780000
           (EMPNO     POSITION( 1)  CHAR(6),                            11790000
            FIRSTNME  POSITION( 8)  VARCHAR,                            11800000
            MIDINIT   POSITION(21)  CHAR(1),                            11810000
            LASTNAME  POSITION(23)  VARCHAR,                            11820000
            WORKDEPT  POSITION(36)  CHAR(3),                            11830000
            PHONENO   POSITION(40)  CHAR(4),                            11840000
            HIREDATE  POSITION(45)  DATE EXTERNAL,                      11850000
            JOB       POSITION(56)  CHAR(8),                            11860000
            EDLEVEL   POSITION(65)  INTEGER EXTERNAL(2),                11870000
            SEX       POSITION(68)  CHAR(1),                            11880000
            BIRTHDATE POSITION(80)  DATE EXTERNAL,                      11890000
            SALARY    POSITION(91)  INTEGER EXTERNAL(5),                11900000
            BONUS     POSITION(97)  INTEGER EXTERNAL(5),                11910000
            COMM      POSITION(103) INTEGER EXTERNAL(5))                11920000
      ENFORCE CONSTRAINTS MAPDDN SYSMAP                                 11930000
                                                                        11940000
//*        STEP 18: SET CURRENT RULES THEN ALTER TABLE                  11950000
//PH01S18 EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)                     11960000
//SYSTSPRT DD  SYSOUT=*                                                 11970000
//SYSTSIN  DD  *                                                        11980000
 DSN SYSTEM(DB1G)                                                       11990000
 RUN  PROGRAM(DSNTIAD) PLAN(DSNTIA41) -                                 12000000
      LIB('DSN410.RUNLIB.LOAD')                                         12010000
//SYSPRINT DD  SYSOUT=*                                                 12020000
//SYSUDUMP DD  SYSOUT=*                                                 12030000
//SYSIN    DD  *                                                        12040000
  SET CURRENT RULES = 'DB2';                                            12050000
  COMMIT;                                                               12060000
  ALTER TABLE EMP ADD CONSTRAINT PERSON                                 12070000
    CHECK (SEX = 'M' OR SEX = 'F');                                     12080000
  COMMIT;                                                               12090000
                                                                        12100000
//*        STEP 19: CHECK DATA IN PART 3 OF DSN8D41A.DSN8S41E           12110000
//*                 FOR REFERENTIAL INTEGRITY                           12120000
//PH01S19 EXEC DSNUPROC,PARM='DB1G,DSNTEX',COND=(4,LT)                  12130000
//SYSUT1   DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   12140000
//SORTLIB  DD  DSN=SYS1.SORTLIB,DISP=SHR                                12150000
//SORTOUT  DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   12160000
//SORTWK01 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   12170000
//SORTWK02 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   12180000
//SORTWK03 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   12190000
//SORTWK04 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   12200000
//DSNTRACE DD  SYSOUT=*                                                 12210000
//SYSERR   DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   12220000
//SYSDISC  DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   12230000
//SYSIN    DD  *                                                        12240000
                                                                        12250000
 CHECK DATA TABLESPACE DSN8D41A.DSN8S41D                                12260000
            TABLESPACE DSN8D41A.DSN8S41E                                12270000
            TABLESPACE DSN8D41A.DSN8S41P                                12280000
       SCOPE ALL                                                        12290000
       DELETE YES                                                       12300000
       FOR EXCEPTION IN DSN8410.DEPT       USE DSN8410.EDEPT            12310000
                     IN DSN8410.EMP        USE DSN8410.EEMP             12320000
                     IN DSN8410.PROJ       USE DSN8410.EPROJ            12330000
                     IN DSN8410.ACT        USE DSN8410.EACT             12340000
                     IN DSN8410.PROJACT    USE DSN8410.EPROJACT         12350000
                     IN DSN8410.EMPPROJACT USE DSN8410.EEPA             12360000
       EXCEPTIONS 50                                                    12370000
       SORTDEVT SYSDA                                                   12380000
                                                                        12390000
//*        STEP 20: ATTEMPT INSERT INTO THE EMP TABLE                   12400000
//PH01S20 EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)                     12410000
//SYSTSPRT DD  SYSOUT=*                                                 12420000
//SYSTSIN  DD  *                                                        12430000
 DSN SYSTEM(DB1G)                                                       12440000
 RUN  PROGRAM(DSNTIAD) PLAN(DSNTIA41) PARM('RC0') -                     12450000
      LIB('DSN410.RUNLIB.LOAD')                                         12460000
//SYSPRINT DD  SYSOUT=*                                                 12470000
//SYSUDUMP DD  SYSOUT=*                                                 12480000
//SYSIN    DD  *                                                        12490000
  INSERT INTO EMP                                                       12500000
    VALUES ('000011','CHRISTINE','I','HAAS','A00','A1A1',               12510000
            '1965-01-01','PRES',18,'F','1933-08-14',                    12520000
            52750,1000,4220);                                           12530000
  COMMIT;                                                               12540000
                                                                        12550000
  INSERT INTO EMP                                                       12560000
    VALUES ('200011','DIANE','J','HEMMINGER','A00','3978',              12570000
            '1965-01-01','SALESREP',18,'U','1933-08-14',                12580000
            46500,1000,4220);                                           12590000
  COMMIT;                                                               12600000
                                                                        12610000
//*        STEP 21: ESTABLISH A QUIESCE POINT FOR PART 3                12620000
//*                 OF DSN8D41A.DSN8S41E                                12630000
//PH01S21 EXEC DSNUPROC,PARM='DB1G,DSNTEX',COND=(4,LT)                  12640000
//* NOTE: CONDITION CODE 4 INDICATES AN IMAGE COPY CANNOT BE TAKEN      12650000
//SYSUT1   DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   12660000
//SYSIN    DD  *                                                        12670000
                                                                        12680000
 QUIESCE TABLESPACE DSN8D41A.DSN8S41E                                   12690000
         PART 3                                                         12700000
                                                                        12710000
//*        STEP 22: TAKE IMAGE COPY OF PART 3 OF DSN8D41A.DSN8S41E      12720000
//PH01S22 EXEC DSNUPROC,PARM='DB1G,DSNTEX',COND=(4,LT)                  12730000
//DSNTRACE DD  SYSOUT=*                                                 12740000
//SYSCOPY  DD  DSN=DSN410.DSN8D41A.DSN8S41E.PART3,                      12750000
//             UNIT=3390,DISP=(NEW,CATLG),SPACE=(4000,(20,20)),         12760000
//             VOL=SER=DB22SY                                           12770000
//SYSIN    DD  *                                                        12780000
                                                                        12790000
 COPY TABLESPACE DSN8D41A.DSN8S41E                                      12800000
      DSNUM 3 COPYDDN SYSCOPY                                           12810000
                                                                        12820000
//*        STEP 23: ESTABLISH A QUIESCE POINT FOR PART 3                12830000
//*                 OF DSN8D41A.DSN8S41E USING ONLY IMAGE COPY          12840000
//PH01S23 EXEC DSNUPROC,PARM='DB1G,DSNTEX',COND=(4,LT)                  12850000
//* NOTE: CONDITION CODE 4 INDICATES AN IMAGE COPY CANNOT BE TAKEN      12860000
//SYSUT1   DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   12870000
//SYSIN    DD  *                                                        12880000
                                                                        12890000
 QUIESCE TABLESPACE DSN8D41A.DSN8S41E                                   12900000
         PART 3                                                         12910000
                                                                        12920000
//*                                                                     12930000
//*        STEP 24: PRODUCE STATISTICS FOR PART 3 OF                    12940000
//*                 OF DSN8D41A.DSN8S41E                                12950000
//PH01S24 EXEC DSNUPROC,PARM='DB1G,DSNTEX',COND=(4,LT)                  12960000
//SORTLIB  DD  DSN=SYS1.SORTLIB,DISP=SHR                                12970000
//SORTOUT  DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   12980000
//SORTWK01 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   12990000
//SORTWK02 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   13000000
//SORTWK03 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   13010000
//SORTWK04 DD  UNIT=3390,SPACE=(4000,(20,20),,,ROUND)                   13020000
//DSNTRACE DD  SYSOUT=*                                                 13030000
//SYSUT1   DD  UNIT=3390,SPACE=(4000,(50,50),,,ROUND)                   13040000
//SYSREC   DD  UNIT=3390,SPACE=(4000,(200,200),,,ROUND)                 13050000
//SYSIN    DD  *                                                        13060000
                                                                        13070000
 RUNSTATS TABLESPACE DSN8D41A.DSN8S41E                                  13080000
         PART 3                                                         13090000
         INDEX(ALL)                                                     13100000
//*                                                                     13110000
