//DUMPSMF JOB (RWM,T),'DUMP',MSGCLASS=Y,NOTIFY=DJY00                    00010000
//*UTPIT OUTPUT DEST=PRT5                                               00011000
//IEFPROC  EXEC PGM=IFASMFDP,REGION=512K                                00012000
//SYSPRINT DD  SYSOUT=*                                                 00013000
//DUMPOUT DD DISP=(NEW,KEEP),DSN=SPARE2.NOV06961.SMFDATA2,              00014000
//    VOL=SER=SPARE2,UNIT=3390,SPACE=(CYL,(25,25))                      00015000
//DUMPIN DD DISP=OLD,DSN=SPARE2.NOV06961.SMFDATA,UNIT=3390,             00016000
// VOL=SER=SPARE2                                                       00017000
