//LISTC1P  JOB (0,MS44),'AZIZ',MSGCLASS=Y,MSGLEVEL=(1,1),                       
//         REGION=4000K,NOTIFY=SRD50                                            
//S1       EXEC  PGM=IDCAMS                                                     
//SYSPRINT DD    SYSOUT=*                                                       
//SYSIN    DD    *                                                              
   LISTC  CATALOG(SYS1.ICFUCAT.VSPARE2)                                         
