//PNURAND2 JOB (D3330RWM,ROOM),'D J YOUNG',MSGCLASS=R,USER= DAVID       00010000
//DOIT    EXEC EDCCPLG,CPARM=LIST,CPARM2=SOURCE                         00020001
//COMPILE.SYSIN DD DSN=DAVID.TPCC.WORKLOAD(NURAND),DISP=SHR             00030000
//CEEOUT DD SYSOUT=*                                                    00040000
